{"420-450": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Vacation Packing List', add three items: 'Passport', 'Sunscreen', and 'Tickets', confirm it, and then remove the item 'Sunscreen'.\",\n        \"solution\": \"First, create a checklist type note called 'Vacation Packing List'. Next, add 'Passport', 'Sunscreen', and 'Tickets' to the checklist. Confirm the new checklist note. Finally, remove the item 'Sunscreen' from the checklist.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a text note titled 'Team Meeting Notes', center-align the text, and set the font size of the app to 125%.\",\n        \"solution\": \"Create a text type note titled 'Team Meeting Notes'. Adjust the alignment to center. Then set the font size of the app to 125%.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new text note titled 'Office Supplies', confirm it, change the theme color to dark red, and then set the font size of the app to 90%.\",\n        \"solution\": \"Create a new text note titled 'Office Supplies' and confirm it. Change the theme color of the Notes app to dark red. Finally, set the font size of the app to 90%.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Create a checklist note titled 'Groceries', add 'Milk', 'Eggs', and 'Bread', confirm it, and then access the 'About' section of the app.\",\n        \"solution\": \"Create a checklist note called 'Groceries'. Add 'Milk', 'Eggs', and 'Bread' to the checklist. Confirm the new checklist note. Finally, access the 'About' section of the app.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Set the font size of the app to 150%, create a new checklist note titled 'Project Steps', add 'Research', 'Design', and 'Testing', confirm it, then change the text color of the app.\",\n        \"solution\": \"Set the font size of the app to 150%. Create a new checklist note titled 'Project Steps'. Add 'Research', 'Design', and 'Testing'. Confirm the new checklist note. Finally, change the text color of the app.\"\n    }\n}\n```"}
{"0-30": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new note titled 'Grocery List', add 'milk, eggs, bread', and save it.\",\n        \"solution\": \"Create a new note with the title 'Grocery List', then save the current note after editing it to 'Need to buy milk, eggs and bread'.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Export the note titled 'Meeting Notes' and print the note titled 'To Print'.\",\n        \"solution\": \"Export the note titled 'Meeting Notes' as a file, then print the note titled 'To Print'.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Rename the note titled 'Old Title' to 'New Title' and lock it.\",\n        \"solution\": \"Rename the note titled 'Old Title' to 'New Title', then lock the note titled 'New Title'.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Create a shortcut for the note titled 'Frequently Used', and set the font size to 250% in the app.\",\n        \"solution\": \"Create a shortcut for the note titled 'Frequently Used', then set the font size to 250% in the Notes app.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Open the note titled 'Vacation Plans', change the font size to 200%, and export it as a file.\",\n        \"solution\": \"Open the note with the title 'Vacation Plans' in the Notes app, adjust the font size to 200%, and export the current note as a file.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Create a new checklist note titled 'Weekly Tasks', add an item 'buy groceries', and remove done items from a checklist titled 'To Do'.\",\n        \"solution\": \"Select the checklist type for a new note titled 'Weekly Tasks', add a new item to the checklist, then remove done items from the checklist titled 'To Do'.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Scroll down the settings page, set the app to automatically save notes, and exit the settings page.\",\n        \"solution\": \"Swipe down on the scroll bar to get more settings from the settings page, set the app to automatically save notes from settings, then exit the settings page.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Rename the current note to 'Meeting Notes', save the edited note, and switch to the next note or checklist item.\",\n        \"solution\": \"Rename the current note to 'Meeting Notes', save the edited note, then switch to the next note or checklist item.\"\n    }\n}\n```"}
{"180-210": "```json\n{\n    'complex task 1': {\n        'task': 'Create a new note titled \"Shopping List\" and edit the content to \"Buy milk, eggs, and bread.\"',\n        'solution': 'Create a new note titled \"Shopping List\", then edit the content of the note to \"Buy milk, eggs, and bread.\"'\n    },\n    'complex task 2': {\n        'task': 'Open the note titled \"Vacation Plans\", change the app font size to 125%, and confirm the sort type of the checklist as date created.',\n        'solution': 'Open the note titled \"Vacation Plans\", set the font size of the app to 125%, then confirm the sort type of the checklist as date created.'\n    },\n    'complex task 3': {\n        'task': 'Create a new checklist type note titled \"Office Tasks\" and add an item \"Prepare presentation\".',\n        'solution': 'Create a new checklist type note titled \"Office Tasks\", then add a new item to the checklist with the content \"Prepare presentation\".'\n    },\n    'complex task 4': {\n        'task': 'Open the note titled \"Recipes\", input \"chocolate\" to search within the note, and highlight the next matching text.',\n        'solution': 'Open the note titled \"Recipes\", search for the term \"chocolate\" within the note, and highlight the next matching text.'\n    },\n    'complex task 5': {\n        'task': 'Create a new note titled \"Books to Read\", then change the app font size to 150%, and edit the content to \"The Great Gatsby\".',\n        'solution': 'Create a new note titled \"Books to Read\", change the app font size to 150%, then edit the content of the note to \"The Great Gatsby\".'\n    },\n    'complex task 6': {\n        'task': 'Create a checklist for \"Weekly Tasks\" and add items \"Finish report\" and \"Plan meeting\".',\n        'solution': 'Create a new checklist titled \"Weekly Tasks\", then add new items to the checklist with the content \"Finish report\" and \"Plan meeting\".'\n    },\n    'complex task 7': {\n        'task': 'Open the note titled \"Recipes\", change the app font size to 200%, and search for the previous matching text \"sugar\".',\n        'solution': 'Open the note titled \"Recipes\", set the font size of the app to 200%, then search for the previous matching text \"sugar\".'\n    },\n    'complex task 8': {\n        'task': 'Create a new note titled \"Movies to Watch\" and edit the content to \"Inception.\"',\n        'solution': 'Create a new note titled \"Movies to Watch\", then edit the content of the note to \"Inception\".'\n    },\n    'complex task 9': {\n        'task': 'Open the note titled \"Weekly Tasks\" and add a new item \"Grocery shopping\".',\n        'solution': 'Open the note titled \"Weekly Tasks\", then add a new item to the checklist with the content \"Grocery shopping\".'\n    },\n    'complex task 10': {\n        'task': 'Create a new note titled \"Meeting Schedule\", input \"deadline\" to search within the current note, and close the search box.',\n        'solution': 'Create a new note titled \"Meeting Schedule\", search for the term \"deadline\" within the note, then close the search box.'\n    }\n}\n```"}
{"300-330": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Project Planning', set the font size to 150%, and add a new checklist item titled 'Define project scope'.\",\n        \"solution\": \"Create a new note titled 'Project Planning'. Select the checklist type for the new note. Set the font size of the note to 150%. Add a new checklist item titled 'Define project scope'. Save the changes made to the note.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Switch to the next note in the list, highlight the word 'deadline', increase the font size to 250%, and change the background color to light gray.\",\n        \"solution\": \"Switch to the next note in the list. Search for the word 'deadline' in the current note. Highlight the next instance of the word 'deadline'. Increase the font size to 250%. Change the background color of the note to light gray. Save the changes made to the note.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Enable autosave notes in the settings, change the text color of the note to blue, and add a new checklist item titled 'Review progress'.\",\n        \"solution\": \"Set autosave notes in the settings. Change the text color of the current note to blue. Add a new checklist item titled 'Review progress'. Save the changes made to the note.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Create a new note for 'Weekly Report', use monospaced font in the settings, and write 'Completed tasks' as a checklist item.\",\n        \"solution\": \"Create a new note titled 'Weekly Report'. Use monospaced font in the settings. Add a new checklist item titled 'Completed tasks'. Save the changes made to the note.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Switch to the previous note, set the font size to 50% for easier reading, and enable line wrap in the settings.\",\n        \"solution\": \"Switch to the previous note in the list. Set the font size of the note to 50%. Enable line wrap in the settings. Save the changes made to the note.\"\n    }\n}\n```"}
{"360-390": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Rename the current note to 'Meeting Notes - April 2024' and then print it.\",\n        \"solution\": \"First, use the rename function to change the note's title to 'Meeting Notes - April 2024'. Next, use the print function to print the note.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Export the current note as a PDF file and create a shortcut on the home screen for the note titled 'Grocery List'.\",\n        \"solution\": \"First, export the current note as a PDF file using the export function. Then, create a shortcut on the home screen for the note titled 'Grocery List'.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new note titled 'Home Repairs' and add a checklist item 'Call plumber', setting the theme color of the Notes app to Dark Red.\",\n        \"solution\": \"Create a new note titled 'Home Repairs'. Then add a checklist item 'Call plumber'. Finally, go to the settings and change the theme color of the Notes app to Dark Red.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Open the note titled 'Meeting Notes', increase the font size to 175%, and add the text 'Discussed project timelines and budget.'\",\n        \"solution\": \"First, open the note titled 'Meeting Notes'. Then increase the font size to 175%. Finally, edit the note to add the text 'Discussed project timelines and budget.'\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a new note with the title 'Weekly Planner' and adjust the text alignment to center, then set the font size to 150%.\",\n        \"solution\": \"Create a new note titled 'Weekly Planner'. Adjust the text alignment to center, and then set the font size to 150%.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Show a note picker on startup in the Notes app and automatically show the keyboard when the Notes app starts.\",\n        \"solution\": \"Enable the note picker on startup in the Notes app settings. Then enable the setting to automatically show the keyboard when the app starts.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a new note titled 'Daily Journal', use a monospaced font for consistent typing experience, and show the word count on the screen.\",\n        \"solution\": \"Create a new note titled 'Daily Journal'. Change the font to monospaced in settings for consistent typing. Enable the option to show the word count on the screen.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the place cursor to the end of the note titled 'To-Do List' every time you open it and enable line wrapping in the Notes app.\",\n        \"solution\": \"Open the note titled 'To-Do List' and adjust the settings to place the cursor at the end every time you open it. Then, enable line wrapping in the Notes app settings.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Delete the note named 'Old Project Ideas' and then create a new note titled 'Project Planning' with the text type.\",\n        \"solution\": \"First, delete the note named 'Old Project Ideas'. Then, create a new note titled 'Project Planning' and select the text note type.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Open the note titled 'Vacation Itinerary', set the font size to 150%, and print the note.\",\n        \"solution\": \"First, open the note titled 'Vacation Itinerary'. Set the font size to 150% in the settings. Finally, use the print function to print the note.\"\n    }\n}\n```"}
{"240-270": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Search for the word 'meeting' in the 'Project Plan' note, highlight the next instance, then modify its content to say 'Team meeting is scheduled for Wednesday'.\",\n        \"solution\": \"Open the note titled 'Project Plan', search for the next matching 'meeting' text within the current note, and then update the content to 'Team meeting is scheduled for Wednesday'.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a new note titled 'Travel Checklist', add 'Passport', then set the font size to 150% and make the links clickable from settings.\",\n        \"solution\": \"Create a new note with the title 'Travel Checklist', add a new checklist item 'Passport', toggle the font size to 150%, and set make links and emails clickable from settings.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Set the font size to 250% in the 'Recipes' note, then center align the text before exiting the settings menu.\",\n        \"solution\": \"Open the note titled 'Recipes', set the font size to 250%, set the alignment of text to center in the notes app, and exit the settings menu after making changes.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Export all your notes into a PDF file, then turn off the setting for displaying save success messages.\",\n        \"solution\": \"Export my notes into a PDF file, and then turn off the setting for displaying save success messages.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Enable line wrap and set the app to show a note picker on startup from settings, then exit settings of the app.\",\n        \"solution\": \"Enable line wrap from the settings, set the app to show a note picker on startup from settings, and then exit settings of the app.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Search for the previous 'deadline' text in the 'Work Tasks' note and highlight the next instance, then close the search box.\",\n        \"solution\": \"Open the note titled 'Work Tasks', search for the previous matching 'deadline' text within the current note, highlight the next instance, and then close the search box in the note.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a new note titled 'Holiday Gifts', set it to 'Checklist' type, add 'Buy chocolates', and then toggle the font size to 75%.\",\n        \"solution\": \"Create a new note with the title 'Holiday Gifts', select the 'Checklist' type for the new note, add a new checklist item 'Buy chocolates', and then toggle the font size to 75%.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the font size to 175% in the 'Workout Plan' note, then search for the word 'routine', highlight the next instance, and exit settings.\",\n        \"solution\": \"Open the note titled 'Workout Plan', set the font size to 175%, search for the word 'routine' in the current note and highlight the next instance, and then exit settings.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Modify the note called 'Office Tasks' to say 'Prepare the monthly report by Friday', then search and highlight the word 'report', and finally enable line wrap from settings.\",\n        \"solution\": \"Open the note titled 'Office Tasks', modify the content to 'Prepare the monthly report by Friday', search for the word 'report' in the current note and highlight the next instance, and then enable line wrap from the settings.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Switch to the previous item in the 'Project Steps' note, then switch to the next item and set the font size to 50%, and ensure the app uses Incognito mode of keyboards from settings.\",\n        \"solution\": \"Open the note titled 'Project Steps', switch to the previous item in the note, switch to the next item in the note, set the font size to 50%, and then set the app to use Incognito mode of keyboards from the settings.\"\n    }\n}\n```"}
{"60-90": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Open the note titled 'Meeting Notes', change the background color to light gray, then save the edits made to the note.\",\n        \"solution\": \"Open the note titled 'Meeting Notes', change the background color to light gray, and then save the current note.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a new text note with the title 'Vacation Ideas', increase the font size to 125%, then add a content summary of today's meeting.\",\n        \"solution\": \"Create a new text note with the title 'Vacation Ideas', then go to app settings to increase the font size to 125%. Return to the note and add the content summary of today's meeting.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Set the app icon color to green and change the primary color of the app to purple, then scroll through the settings page to find the data backup option.\",\n        \"solution\": \"Set the app icon color to green, change the primary color of the app to purple, and then scroll through the settings page to find the data backup option.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Open the note titled 'Grocery List', add a new checklist item titled 'Groceries', then sort the items using custom sorting.\",\n        \"solution\": \"Open the note titled 'Grocery List', add a new checklist item titled 'Groceries', and then sort the items using custom sorting.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a new text note titled 'Book List', set the font size to 75%, then create a shortcut for this note.\",\n        \"solution\": \"Create a new text note titled 'Book List' and set the font size to 75%. After that, create a shortcut for the note.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Open the note titled 'Workout Plan', adjust the font size to 90%, then save the current note and switch to the next note.\",\n        \"solution\": \"Open the note titled 'Workout Plan', adjust the font size to 90%, save the current note, and then switch to the next note.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Delete the note titled 'Old Receipts' and then view information about the Notes app.\",\n        \"solution\": \"Delete the note titled 'Old Receipts' and then navigate to view information about the Notes app.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Create a new text note titled 'Grocery List', then add the title 'Work Meeting Notes' to another new note.\",\n        \"solution\": \"Create a new text note titled 'Grocery List', then create another new text note and add the title 'Work Meeting Notes'.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Import notes from an external source and lock the note containing sensitive information, then confirm.\",\n        \"solution\": \"Import notes from an external source, then identify the note containing sensitive information, lock it, and confirm the action.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Open the 'Meeting Notes', add a summary of today's meeting to the content, save changes made and then close the search box if it is open.\",\n        \"solution\": \"Open the 'Meeting Notes', add a summary of today's meeting to the content, save the changes, and ensure to close the search box if it is open.\"\n    }\n}\n```"}
{"120-150": "```json\n{\n    'complex task 1': {\n        'task': 'Create a new checklist note titled \"Weekend Chores\" with tasks and switch the theme color to dark red',\n        'solution': 'First, create a new checklist note titled \"Weekend Chores\" and add the desired tasks. Then, go to the app settings and switch the theme color to dark red.'\n    },\n    'complex task 2': {\n        'task': 'Open the note titled \"Grocery List\", change the text color to blue, and set the background color of the app to light grey',\n        'solution': 'Open the note titled \"Grocery List\". Change the text color of the entire note to blue. Then, navigate to app settings and set the background color to light grey.'\n    },\n    'complex task 3': {\n        'task': 'Create a checklist titled \"Travel Packing\", confirm sorting the checklist items by title, then export all notes to local storage',\n        'solution': 'Create a new checklist titled \"Travel Packing\". After adding the items, confirm the checklist is sorted by title. Finally, export all notes to local storage from the app settings.'\n    },\n    'complex task 4': {\n        'task': 'Enable autosave notes feature, create a new text note, and set the font size to 150% for the new note',\n        'solution': 'Go to the app settings and enable the autosave notes feature. Then, create a new text note and set the font size to 150% for this note.'\n    },\n    'complex task 5': {\n        'task': 'Create a new note titled \"Meeting Notes\", switch the app theme color to dark, and enable automatic backups for notes',\n        'solution': 'First, create a new note titled \"Meeting Notes\". Then, change the app theme color to dark from the settings. Lastly, enable automatic backups for notes through the app settings.'\n    },\n    'complex task 6': {\n        'task': 'Switch to the note titled \"Workout Plan\", set the app font size to 175%, and enable display of save success messages',\n        'solution': 'Switch to the note titled \"Workout Plan\". Change the app font size to 175% in the settings. Finally, enable the display of save success messages in the app settings.'\n    },\n    'complex task 7': {\n        'task': 'Create a checklist titled \"Home Improvement\" with tasks, sort the checklist items by the date they were created, and set the app to autosave notes',\n        'solution': 'First, create a checklist titled \"Home Improvement\" and add the tasks. Then, sort the checklist items by the date they were created. Finally, enable the autosave notes feature in the app settings.'\n    },\n    'complex task 8': {\n        'task': 'Create a new note titled \"Grocery List\", change the text color of the note to blue, and import notes from your email account',\n        'solution': 'Create a new note titled \"Grocery List\". Change the text color of this note to blue. After that, go to the app settings and import notes from your email account.'\n    },\n    'complex task 9': {\n        'task': 'Create a new checklist note, set the app icon color to green, and set the background color of the app to light grey',\n        'solution': 'Create a new checklist type note. Then, change the app icon color to green from the app settings. Finally, set the app background color to light grey in the settings.'\n    },\n    'complex task 10': {\n        'task': 'Open the note titled \"Meeting Minutes\", decrease the font size to 150%, and sort the current checklist items by the date they were created',\n        'solution': 'Open the note titled \"Meeting Minutes\". Decrease the font size to 150%. Then, sort the checklist items in the note by the date they were created.'\n    }\n}\n```"}
{"450-480": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Grocery List', add 'Eggs', 'Milk', and 'Bread' as items, then sort them by title.\",\n        \"solution\": \"Create a new checklist note named 'Grocery List', add 'Eggs', 'Milk', and 'Bread' to it, and finally sort the items of the checklist by title.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Open the note titled 'Travel Details', switch its type to text note, and confirm the changes.\",\n        \"solution\": \"Open the note titled 'Travel Details', change the note type to text, and confirm the changes.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new text note titled 'Daily Schedule', set the font size of the app to 75%, and add '9 AM: Meeting with team' to the note.\",\n        \"solution\": \"Create a new text note named 'Daily Schedule', adjust the app font size to 75%, and add '9 AM: Meeting with team' to the note.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the Notes app to show a note picker on startup, then create a new note with the title 'Project Ideas'.\",\n        \"solution\": \"Configure the Notes app settings to display a note picker on startup and create a new note titled 'Project Ideas'.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a note named 'Home Renovation', change the theme color of the Notes app to light, then add 'Kitchen remodeling' to the note.\",\n        \"solution\": \"Create a note titled 'Home Renovation', switch the app theme to light mode, and add 'Kitchen remodeling' to the note.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Set autosave notes on in the settings, create a text note titled 'Work Summary', and add 'Complete project report' to it.\",\n        \"solution\": \"Enable autosave for notes in the app settings, create a new text note named 'Work Summary', and add 'Complete project report' to the note.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Rename the current note to 'Budget Plan', adjust the app font size to 60%, and save the changes.\",\n        \"solution\": \"Rename the current note to 'Budget Plan', set the app font size to 60%, and save the changes.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Create a new note named 'Exercise Routine', set the type of note to checklist, and add 'Push-ups', 'Sit-ups', 'Running' to it.\",\n        \"solution\": \"Create a new note named 'Exercise Routine', set the note type to checklist, and add 'Push-ups', 'Sit-ups', and 'Running' to the list.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Open the note titled 'Project Timeline', highlight the next matched text for the word 'deadline', and save any changes.\",\n        \"solution\": \"Open the note titled 'Project Timeline', highlight the next instance of the word 'deadline', and save changes if any were made.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Switch to the previous note, change its title to 'Meeting Notes' and adjust the font size to 150%.\",\n        \"solution\": \"Switch to the previous note, rename it to 'Meeting Notes', and set the app font size to 150%.\"\n    }\n}\n```"}
{"330-360": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new note titled 'Business Plan', add a checklist item with the title 'Budget Planning', and highlight the next occurrence of 'market research' in the note\",\n        \"solution\": \"To complete this task, first create a new text note titled 'Business Plan'. Then add a checklist item titled 'Budget Planning'. Finally, perform a search to highlight the next occurrence of the phrase 'market research'.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Open the note titled 'Vacation Packing', move the checklist item 'Sunglasses' to the bottom of the list, and export the note as a file\",\n        \"solution\": \"To complete this task, first open the note titled 'Vacation Packing'. Move the checklist item 'Sunglasses' to the bottom of the list. After that, export the note as a file.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Add a new checklist item with the title 'Weekend Plan', create tasks 'Grocery Shopping', 'Clean the House', and then save the note\",\n        \"solution\": \"To complete this task, add a new checklist titled 'Weekend Plan'. Under this checklist, create the tasks 'Grocery Shopping' and 'Clean the House'. Finally, save the changes made to the note.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Create a new note titled 'Client Meetings', add 'Remember to call John tomorrow', find the word 'meeting' within the note, and then edit the content to include 'Prepare presentation slides'\",\n        \"solution\": \"First, create a new note titled 'Client Meetings'. Then add the sentence 'Remember to call John tomorrow'. Use the search function to find the word 'meeting' within the note. After finding it, edit the content to also include 'Prepare presentation slides'.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Open the note titled 'Grocery List', decrease the font size to 50%, delete the checklist item 'Old Meeting Agenda', and save the note\",\n        \"solution\": \"To complete this task, open the note titled 'Grocery List'. Change the font size to 50%. Delete the checklist item 'Old Meeting Agenda' from the list, and then save the note.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Rename the current note to 'Weekly Agenda', add a checklist item 'Book hotels for trips', move the item 'Book hotels for NY and LA' to the top of the list, and set the font size of the app to 60%\",\n        \"solution\": \"First, rename the current note to 'Weekly Agenda'. Add a checklist item 'Book hotels for trips'. Move the item 'Book hotels for NY and LA' to the top of the list. Finally, set the font size of the app to 60%.\"\n    }\n}\n```"}
{"270-300": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Open the note titled 'Project Timeline', search for the term 'project deadline' within it, and then close the search box after looking at the results.\",\n        \"solution\": \"Firstly, open the note titled 'Project Timeline', use the search function to find 'project deadline', review the search results, and finally close the search box.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Switch to the previous note item, then edit its content to 'Tomorrow meeting at 10:00' and save the changes.\",\n        \"solution\": \"Navigate to the previous note item, modify its content to 'Tomorrow meeting at 10:00', and save the updates.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new note with the title 'Vacation Packing', set the font size to 60%, and enable automatic backups.\",\n        \"solution\": \"Start by creating a new note titled 'Vacation Packing', adjust the font size to 60%, and then go to settings to enable automatic backups.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Open the color settings and change the primary color of the app to red, then switch to the note item titled 'Goals' and set its font size to 175%.\",\n        \"solution\": \"Begin by accessing the color settings to change the primary color to red. Next, open the 'Goals' note and adjust its font size to 175%.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Search for the text 'project' within the current note, make links and emails clickable in the settings, and switch to the next note item.\",\n        \"solution\": \"Search for 'project' within the current note, update settings to make links and emails clickable, and then move to the next note item.\"\n    }\n}\n```"}
{"90-120": "```json\n{\n    'complex task 1': {\n        'task': 'Highlight and search for all instances of the word \"meeting\" in the note titled \"Project Updates\", then switch to the previous note and change the font size to 175%.',\n        'solution': 'Open the note titled \"Project Updates\". Search for the word \"meeting\" and then keep highlighting the next occurrence until all are found. Return to the previous note in the list and set the font size to 175%.'\n    }, \n    'complex task 2': {\n        'task': 'Create a new note titled \"Travel Itinerary\" and then set the font size to 200%, followed by toggling the app theme color to black & white.',\n        'solution': 'Create a new note with the title \"Travel Itinerary\" of type text. Increase the font size to 200%. Then, toggle the theme color to black & white.'\n    },\n    'complex task 3': {\n        'task': 'Search for the word \"budget\" in the note titled \"Annual Financial Plan\" and highlight the next matching text within the current note, then sort the checklist items by title.',\n        'solution': 'Open the note titled \"Annual Financial Plan\". Search for the word \"budget\". Highlight the next matching text within the note, then sort the checklist items by title.'\n    },\n    'complex task 4': {\n        'task': 'Save the changes to the note titled \"Holiday Plans\" and then import notes from local storage, toggle the setting to display save success messages.',\n        'solution': 'Save the changes made to the note titled \"Holiday Plans\". Import notes from local storage. Then, toggle the setting to display save success messages.'\n    },\n    'complex task 5': {\n        'task': 'Add an item titled \"Buy Groceries\" to the checklist \"Weekend Chores\" and then scroll down to view the next item on the checklist.',\n        'solution': 'Add an item titled \"Buy Groceries\" to the checklist \"Weekend Chores\". Then, scroll down to view the next item on the checklist.'\n    },\n    'complex task 6': {\n        'task': 'Search for the previous occurrence of the word \"meeting\" in the note \"Team Strategy\", highlight it, then close the search box.',\n        'solution': 'Open the note titled \"Team Strategy\". Search the previous matching text \"meeting\" within the note. Highlight it, then close the search box.'\n    },\n    'complex task 7': {\n        'task': 'Switch to the next note in the list, save the current color settings of the app, then switch back to the previous note and close the color setting popup.',\n        'solution': 'Switch to the next note in the list. Save the current color settings of the app. Switch back to the previous note and close the color setting popup.'\n    },\n    'complex task 8': {\n        'task': 'Create a new checklist for \"Conference Prep\", add an item titled \"Book Venue\", then highlight the previous occurrence of the word \"project\" in the current note.',\n        'solution': 'Create a new checklist for \"Conference Prep\". Add an item titled \"Book Venue\". Highlight the previous occurrence of the word \"project\" in the current note.'\n    }\n}\n```"}
{"390-420": "```json\n{\n    'complex task 1': {\n        'task': 'Create a new note titled \"Weekend Plans\", customize widget colors to blue and white, and then switch the theme to a custom setting.',\n        'solution': 'First, create a new note with the title \"Weekend Plans\". Next, go to the settings and change the widget colors to blue and white. Finally, switch the theme of the app to a custom setting.'\n    },\n    'complex task 2': {\n        'task': 'Delete the note \"Old Notes\", then create a new note titled \"Grocery List\" and add a checklist item \"Grocery Shopping\" at the top.',\n        'solution': 'First, delete the note titled \"Old Notes\". Next, create a new note with the title \"Grocery List\". Lastly, add a new checklist item titled \"Grocery Shopping\" to the top of the checklist in the new note.'\n    },\n    'complex task 3': {\n        'task': 'Change the font size to 250%, enable line wrap, and then set the app to automatically save notes every 5 minutes.',\n        'solution': 'First, change the font size in the Notes app to 250%. Then, enable line wrap in the app settings. Finally, set the app to automatically save notes every 5 minutes.'\n    },\n    'complex task 4': {\n        'task': 'Create a shortcut for the note \"ToDo List\", lock the note \"Personal Diary\", and then switch to the next note in the Notes app.',\n        'solution': 'First, create a shortcut for the note titled \"ToDo List\". Next, lock the note titled \"Personal Diary\". Finally, switch to the next note in the Notes app.'\n    },\n    'complex task 5': {\n        'task': 'Use monospaced font for the note \"Snippet Collection\", then search for the word \"meeting\" and highlight it in the current note.',\n        'solution': 'First, set the note titled \"Snippet Collection\" to use a monospaced font for easier code readability. Next, perform a search within the current note for the word \"meeting\" and highlight the next instance found.'\n    },\n    'complex task 6': {\n        'task': 'Lock the note \"Personal Diary\" with a password, set the app to show a recent notes picker on launch, and then display the keyboard immediately when starting a new note.',\n        'solution': 'First, lock the note titled \"Personal Diary\" with a password. Then, set the app to show a picker for recent notes every time it is launched. Finally, configure the app to display the keyboard immediately when starting a new note.'\n    },\n    'complex task 7': {\n        'task': 'Customize widget colors to blue and white, navigate to the next checklist item, and then make links and emails clickable in the notes app.',\n        'solution': 'First, go to settings and customize the widget colors to blue and white. Next, navigate to the next checklist item in the notes app. Finally, make links and emails clickable in the notes app.'\n    },\n    'complex task 8': {\n        'task': 'Open the file attached to the note \"Project Plan\", change the theme to Black & White, and then save the changes made to the current note.',\n        'solution': 'First, open the file attached to the note titled \"Project Plan\". Then, switch the theme color setting to Black & White. Lastly, save the changes made to the currently open note.'\n    }\n}\n```"}
{"30-60": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist type note titled 'Grocery List', add a new checklist item named 'Buy groceries', and then print the checklist.\",\n        \"solution\": \"First, create a new checklist type note titled 'Grocery List'. Then, add a new checklist item named 'Buy groceries'. Finally, print the checklist.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Open the note titled 'Read Later', search for the term 'budget' and highlight the next instance, and then close the search box after finding the needed information.\",\n        \"solution\": \"Start by opening the note titled 'Read Later'. Then search for the term 'budget', highlight the next instance found, and close the search box when the information is located.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Change the text color of the note to blue, set the font size of the note to 150%, and then export the note titled 'Vacation Itinerary' as a PDF file.\",\n        \"solution\": \"First, change the text color of the note to blue. Then, set the font size of the note to 150%. Finally, export the note titled 'Vacation Itinerary' as a PDF file.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the alignment of the app, switch the theme color to dark red in the Notes app, and finally lock the current note with a password.\",\n        \"solution\": \"Scroll through the settings page and set the alignment of the app. Then, switch the theme color to dark red. Finally, lock the current note with a password.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Edit the content of the current note to 'Discuss budget allocations', create a shortcut for the current note, and then maximize the font size to 300% in the Notes app.\",\n        \"solution\": \"First, edit the content of the current note to 'Discuss budget allocations'. Next, create a shortcut for the current note. Finally, maximize the font size to 300% in the Notes app.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Rename the current note to 'Meeting Notes April 27', scroll to the next note or checklist item, and customize the widget colors to blue and yellow.\",\n        \"solution\": \"Rename the current note to 'Meeting Notes April 27'. Then, scroll to the next note or checklist item. Lastly, customize the widget colors to blue and yellow.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Search for the term 'budget' in the current note, remove all completed items from the current checklist, and then export the note as a PDF file.\",\n        \"solution\": \"Begin by searching for the term 'budget' in the current note. Next, remove all completed items from the current checklist. Finally, export the note as a PDF file.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Switch to the next note in the list, set the font size to 125%, and print the current note.\",\n        \"solution\": \"First, switch to the next note in the list. Then, set the font size to 125%. Finally, print the current note.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Change the text color of the note to blue, lock the current note with a password, and then search for the term 'budget' in the current note highlighting the next instance.\",\n        \"solution\": \"First, change the text color of the note to blue. Next, lock the current note with a password. Finally, search for the term 'budget' in the current note and highlight the next instance.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Minimize the font size to 60%, open the about page of the app, and then close the search box.\",\n        \"solution\": \"Minimize the font size to 60%. Then, open the about page of the app. Finally, close the search box.\"\n    }\n}\n```"}
{"540-570": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new note with the title 'Travel Itinerary', set its type to text, and enable line wrapping while writing.\",\n        \"solution\": \"First, create a new note with the title 'Travel Itinerary' and select the text note type. Then, while writing the note, enable the line wrapping feature.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Set the theme color of the app to Light, change the font size to 250%, and ensure monospaced font is enabled.\",\n        \"solution\": \"Go to settings to set the theme color to Light, change the font size to 250%, and select the checkbox to use a monospaced font.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new note with the title 'Meeting Notes', set its type to checklist, and make sure links and emails are clickable.\",\n        \"solution\": \"First, create a new note with the title 'Meeting Notes' and set the type to checklist. Then, select the checkbox to make links and emails clickable in the note.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the theme color of the app to Dark Red, change the font size to 200%, and change the app icon color to red.\",\n        \"solution\": \"Go to settings to set the theme color to Dark Red, change the font size to 200%, and change the app icon color to red.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Enable incognito mode for keyboards, set the background color to white, and set the text color to blue.\",\n        \"solution\": \"In settings, enable the incognito mode for keyboards, set the background color to white, and set the text color to blue.\"\n    }\n}\n```"}
{"480-510": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Vacation Packing List', rename the first item to 'Essentials', move it to the top, and export the note as a PDF file.\",\n        \"solution\": \"Add a new note with the title 'Vacation Packing List' and select the checklist type, rename the selected checklist item to 'Essentials', move the selected checklist item to the top of the list, then export the note titled 'Vacation Packing List' as a PDF file.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a text note titled 'Weekly Report', highlight the previous matched text in the search within the note, change the theme to black and white, and then print the note.\",\n        \"solution\": \"Add a new note with the title 'Weekly Report' and select the text note type, highlight the previous matched text in the search within the note, change the theme of the Notes app to black and white, and then print the note 'Weekly Report'.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Switch to the next note by swiping down using the scrollbar, set the theme color to dark red, increase the font size to 250%, and export all notes to the 'Documents' folder.\",\n        \"solution\": \"Switch to the next note by swiping down using the scrollbar, change the theme color to dark red, increase the font size to 250%, then export notes to the 'Documents' folder.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Import notes from the 'Backup' folder, customize the widget colors, create a shortcut on the home screen for the note 'Workout Routine', and remove all completed items from the checklist 'Daily Tasks'.\",\n        \"solution\": \"Import notes from the 'Backup' folder, customize the widget colors, create a shortcut on the home screen for the note 'Workout Routine', then remove all completed items from the checklist 'Daily Tasks'.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a note titled 'Meeting Agenda' selecting text note type, then switch to the next note, change the theme to custom color, and save the theme colors of the app.\",\n        \"solution\": \"Add a new note with the title 'Meeting Agenda' and select the text note type, switch to the next note by swiping down using the scrollbar, change the theme of the Notes app to custom color, then save the colors of the app.\"\n    }\n}\n```"}
{"210-240": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Switch to the next note, change the font size to 150%, and search for the term 'meeting' in the current note.\",\n        \"solution\": \"First, switch to the next note. Then, change the font size to 150%. Finally, search for the term 'meeting' in the current note.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a new note with the title 'Vacation Plans', set the font size to 125%, and add the item 'Book hotel' to the checklist.\",\n        \"solution\": \"Begin by creating a new note titled 'Vacation Plans'. Next, set the font size to 125%. Then, add the item 'Book hotel' to the checklist.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Open the note titled 'Grocery List', switch to the previous item in the checklist, and highlight the term 'milk'.\",\n        \"solution\": \"Open the note titled 'Grocery List'. Then, switch to the previous item in the checklist and highlight the term 'milk'.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Change the current note title to 'Project Notes', display the word count for the notes, and enable automatic backups in settings.\",\n        \"solution\": \"Change the current note title to 'Project Notes'. Next, display the word count for the notes. Finally, enable automatic backups in settings.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Import the notes from my previously saved file, sort the checklist items by date created, and customize widget colors to blue and yellow.\",\n        \"solution\": \"First, import the notes from your previously saved file. Then, sort the checklist items by date created. Finally, customize the widget colors to blue and yellow.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Go to the color settings and adjust the app icon color to green, save the color modifications made, and close the color settings window.\",\n        \"solution\": \"Navigate to the color settings and adjust the app icon color to green. Save your color modifications and then close the color settings window.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Switch to the next note, set the keyboard to incognito mode, and search for the text 'lunch' within the current note.\",\n        \"solution\": \"Switch to the next note. Then, set the keyboard to incognito mode. Finally, search for the text 'lunch' within the current note.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Enable line wrap in the notes app, change the font size to 125%, and show the note picker every time the app starts.\",\n        \"solution\": \"Enable line wrap in the notes app. Change the font size to 125%. Then, enable the option to show the note picker every time the app starts.\"\n    }    \n}\n```"}
{"600-630": "```json\n{\n    'complex task 1': {\n        'task': 'Create three new notes named \"Daily Journal\", \"Research Notes\", and \"Shopping List\" with appropriate types, then rename the \"Shopping List\" note to \"Grocery List\".',\n        'solution': 'Add a new note with the title \"Daily Journal\" and select the text note type. Add a new note with the title \"Research Notes\" and select the text note type. Add a new note with the title \"Shopping List\" and select the checklist type. Change the name of the current note to \"Grocery List\".'\n    }, \n    'complex task 2': {\n        'task': 'Create a new checklist note titled \"Vacation Checklist\", add some items, move one item to the top, and rename another item \"Packing Essentials\".',\n        'solution': 'Add a new note with the title \"Vacation Checklist\" and select the checklist type. Add a few items to the checklist. Move the selected checklist item to the top of the list. Rename the selected checklist item to \"Packing Essentials\".'\n    },\n    'complex task 3': {\n        'task': 'Set up automatic backups and change the font size of the app to 125%, then print the current note.',\n        'solution': 'Enable automatic backups of notes. Set the font size of the app to 125%. Print the current note.'\n    },\n    'complex task 4': {\n        'task': 'Open, change the text color to blue, and lock the current note. Then, create a shortcut for it.',\n        'solution': 'Open the file of the current note. Set the text color of the current note to blue. Lock the current note. Create a shortcut for the current note.'\n    },\n    'complex task 5': {\n        'task': 'Add a new text note titled \"Meeting Notes\". Rename it and export the note as a file.',\n        'solution': 'Add a new note with the title \"Meeting Notes\" and select the text note type. Rename the current note to \"Meeting Notes\". Export the current note as a file.'\n    }\n}\n```"}
{"150-180": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Weekend Packing List', change the app theme to dark red, and set automatic backups to enabled.\",\n        \"solution\": \"Create a new checklist note titled 'Weekend Packing List'. Then, change the theme color of the app to dark red. Finally, enable automatic backups in the app settings.\"\n    }, \n    \"complex task 2\": {\n        \"task\": \"Open the note titled 'Workout Routine', highlight the next instance of 'milk' in the note search, and change the font size to 125%.\",\n        \"solution\": \"Open the note titled 'Workout Routine'. Use the note search to find 'milk' and highlight its next instance. Then, adjust the app font size to 125%.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new text note titled 'Movie List', change the app theme to black and white, and save the current color settings.\",\n        \"solution\": \"Create a new text note titled 'Movie List'. Change the theme color of the app to black and white. After ensuring the colors are set, save the current color settings.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Scroll through the list of open note titles, then open the note titled 'Project Ideas', and change the note type to text for the note titled 'Book Ideas'.\",\n        \"solution\": \"Scroll through the list of open note titles. After that, open the note titled 'Project Ideas'. Finally, change the note type to text for the note titled 'Book Ideas'.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a new text note titled 'Travel Itinerary', change the primary color of the app to teal, and change the font size to 150%.\",\n        \"solution\": \"Create a new text note titled 'Travel Itinerary'. Then, change the primary color of the app to teal. Finally, adjust the app font size to 150%.\"\n    }, \n    \"complex task 6\": {\n        \"task\": \"Create a new checklist note titled 'Daily Tasks', change the app theme to light, and close the color settings window after saving the current color settings.\",\n        \"solution\": \"Create a new checklist note titled 'Daily Tasks'. Change the theme color of the app to light. Save the current color settings, and then close the color settings window.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a new text note titled 'Birthday Party Ideas', change the app font size to 200%, and set automatic backups to enabled.\",\n        \"solution\": \"Create a new text note titled 'Birthday Party Ideas'. Adjust the app font size to 200%. Finally, enable automatic backups in the app settings.\"\n    }, \n    \"complex task 8\": {\n        \"task\": \"Create a new checklist note titled 'Books to Read', open the note titled 'Holiday Plans', and change the app theme to white.\",\n        \"solution\": \"Create a new checklist note titled 'Books to Read'. Then, open the note titled 'Holiday Plans'. Finally, change the theme color of the app to white.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Create a new text note titled 'Daily Diary', change the font size to 90%, then change the theme color to custom, and save the color settings.\",\n        \"solution\": \"Create a new text note titled 'Daily Diary'. Adjust the app font size to 90%. Change the theme color of the app to custom and save the current color settings.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Create a new checklist note, change the app primary color to teal, and change the font size to 50%.\",\n        \"solution\": \"Create a new checklist note. Change the primary color of the app to teal. Finally, adjust the app font size to 50%.\"\n    }\n}\n```"}
{"840-870": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Automatically back up notes, change the theme color to black and white, and display save success messages.\",\n        \"solution\": \"Enable automatic backups to cloud storage; Change the theme color to black and white; Display save success messages after each note is saved.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Add a new note titled 'Conference Schedule' as a checklist, rename the first item to 'Keynote Speaker', and move it to the top.\",\n        \"solution\": \"Add a new note with the title 'Conference Schedule' and select the checklist type; Rename the selected checklist item to 'Keynote Speaker'; Move the selected checklist item to the top of the list.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new text note titled 'Vacation Plans', lock it, and confirm the lock.\",\n        \"solution\": \"Add a new note with the title 'Vacation Plans' and select the text note type; Lock the current note and confirm locking.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Open the note 'Work Report', print it, and then rename it to 'Annual Report'.\",\n        \"solution\": \"Open the file associated with the note 'Work Report'; Print the current note; Rename the current note to 'Annual Report'.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Add a new note titled 'Groceries', add 'Milk' and 'Bread' as checklist items, and then delete the item 'Bread'.\",\n        \"solution\": \"Add a new note with the title 'Groceries' and select the checklist type; Rename the selected checklist item to 'Milk'; Move the selected checklist item to the bottom of the list; Rename the selected checklist item to 'Bread'; Delete the selected checklist item.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Set the app theme to dark red, then change it back to light.\",\n        \"solution\": \"Set the theme color to dark red; Change the theme color to light.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a new checklist note titled 'Study Plan', rename an item to 'Subjects to Cover', and remove all completed items.\",\n        \"solution\": \"Add a new note with the title 'Study Plan' and select the checklist type; Rename the selected checklist item to 'Subjects to Cover'; Remove all completed items from the checklist.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Change the theme to white, print the note 'Project Proposal', and exit settings menu.\",\n        \"solution\": \"Select the white theme for the app; Print the note 'Project Proposal'; Exit the settings menu.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Enable incognito mode for the keyboard and show the keyboard automatically on startup.\",\n        \"solution\": \"Use Incognito mode for keyboard to enhance privacy; Show the keyboard automatically on startup.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Turn on line wrap for easier reading and rename the current note to 'Meeting Summary'.\",\n        \"solution\": \"Turn on line wrap for easier reading; Rename the current note to 'Meeting Summary'.\"\n    }\n}\n```"}
{"570-600": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new note titled 'Fitness Goals', select checklist type, rename the first item to 'Workout Plan', then move it to the top of the list.\",\n        \"solution\": \"Add a new note with the title 'Fitness Goals' and select the checklist type, rename the selected checklist item to 'Workout Plan', move the selected checklist item to the top of the list.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Adjust the app to have a green primary color and set the font size to 100%.\",\n        \"solution\": \"Change the primary color of the app to green, set font size to 100%.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new text note titled 'Research Notes', save the note, then set the font size to 50%.\",\n        \"solution\": \"Add a new note with the title 'Research Notes' and select the text note type, confirm the creation of a new note, set the font size to 50%.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Create a checklist note titled 'Shopping List', rename the first item to 'Grocery Items', then delete this item.\",\n        \"solution\": \"Add a new note with the title 'Shopping List' and select the checklist type, rename the selected checklist item to 'Grocery Items', delete the selected checklist item.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Import notes from a backup file and export the current note with its settings.\",\n        \"solution\": \"Import notes from the backup file, export the current note with its settings.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Create a checklist note titled 'Shopping List', rename the first item to 'Groceries', move this item to the bottom of the list, then confirm the note creation.\",\n        \"solution\": \"Add a new note with the title 'Shopping List' and select the checklist type, rename the selected checklist item to 'Groceries', move the selected checklist item to the bottom of the list, confirm the creation of a new note.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a text type note, set the font size to 50%, and close the color settings popup.\",\n        \"solution\": \"Create a text type note, set the font size to 50%, close the color settings popup.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Create a new checklist note titled 'Travel Notes', save it, and disable the option to display saving success messages.\",\n        \"solution\": \"Add a new note with the title 'Travel Notes' and select the text note type, confirm the creation of a new note, disable the option to display save success messages.\"\n    }\n}\n```"}
{"780-810": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a shortcut for the note titled 'Grocery List' on the home screen and customize the widget colors to blue and white.\",\n        \"solution\": \"First, apply the color customizations for the widget by setting the colors to blue and white, then proceed to create a shortcut for the note titled 'Grocery List' on the home screen.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Add a new note with the title 'Workout Plan' as a text note, set the font size to 100%, and enable clickable links and emails in notes.\",\n        \"solution\": \"Begin by adding a new text note with the title 'Workout Plan'. Once created, set the font size to 100%, and enable the clickable links and emails feature in the app settings.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Rename the selected checklist item to 'Fruits and Vegetables', move it to the top of the list, and then delete the selected item.\",\n        \"solution\": \"First, rename the selected checklist item to 'Fruits and Vegetables'. Next, move this item to the top of the list, and finally, delete it.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Add a new note with the title 'Home Repairs' as a checklist, enable automatic backups, and set the background color to light grey.\",\n        \"solution\": \"Start by adding a new checklist note titled 'Home Repairs'. Then, go to settings and enable the automatic backups feature. Finally, set the app's background color to light grey.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a note titled 'Vacation Plans' and set the font size to 75%, enable autosave notes feature, and display the current word count.\",\n        \"solution\": \"First, create a new note titled 'Vacation Plans'. Set the font size to 75%, enable the autosave notes feature, and then display the current word count for this note.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Customize the app icon color to red, change the text color to blue, and set the font size to 60%.\",\n        \"solution\": \"Access the settings to customize the app icon to red. Next, adjust the text color to blue, and subsequently set the font size to 60%.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Add a new note titled 'Code Snippets' with a monospaced font, enable line wrapping, and set the keyboard to Incognito mode.\",\n        \"solution\": \"Create a new note titled 'Code Snippets'. Then, change its font to a monospaced type. Enable the line wrapping option in settings and set the keyboard to Incognito mode.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Enable the autosave notes feature, then sort all checklist items by date created, and exit the settings menu.\",\n        \"solution\": \"First, enable the autosave notes feature in the settings. Next, sort all checklist items by their creation date. Finally, exit the settings menu.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Delete the selected checklist item, create a new text note titled 'Mindfulness Practices', and display the keyboard automatically when opening the app.\",\n        \"solution\": \"Start by deleting the selected checklist item. Then, create a new text note titled 'Mindfulness Practices'. Go to the settings and enable the option to display the keyboard automatically upon opening the app.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Add a new checklist note titled 'Daily Tasks', move the first checklist item to the bottom, and enable clickable links in notes.\",\n        \"solution\": \"Begin by adding a new note with the checklist type and title it 'Daily Tasks'. Move the first item in this checklist to the bottom. Lastly, enable the clickable links and emails feature in the app settings.\"\n    }\n}\n```"}
{"510-540": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Weekend Tasks', select the checklist type, add items 'Buy groceries', 'Clean the house', 'Visit friends', and confirm it.\",\n        \"solution\": \"Create a new checklist note titled 'Weekend Tasks', add items 'Buy groceries', 'Clean the house', 'Visit friends', and confirm the note.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Open the note 'Project Proposal', scroll through the settings page to view advanced options, and then enable automatic backups.\",\n        \"solution\": \"Open the note 'Project Proposal', navigate to settings, scroll to advanced options, and enable automatic backups.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new text note titled 'Grocery List', confirm it, and then change the font size to 175%.\",\n        \"solution\": \"Create a new text note with the title 'Grocery List', confirm it, and then adjust the font size to 175% in the settings.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Add a new note titled 'Work Notes' and select the text note type, enable line wrap, and then show word count in the notes.\",\n        \"solution\": \"Create a new note titled 'Work Notes' as a text note, enable line wrap in the settings, and activate showing the word count.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Scroll down the settings page, set the theme color to Dark, and then increase the font size to 200%.\",\n        \"solution\": \"Navigate to the settings page, scroll down, set the theme color to Dark, and adjust the font size to 200%.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Open a new note and set its title to 'Shopping List', select the 'Checklist' type for the new note, and then sort the items of the current checklist by Custom.\",\n        \"solution\": \"Create a new checklist note titled 'Shopping List', then use the option to sort the items in the current checklist by Custom.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a new checklist note titled 'Party Checklist', confirm it, rename the selected checklist item to 'Party Items', and lock the note 'Personal Diary'.\",\n        \"solution\": \"Create a new checklist note titled 'Party Checklist', confirm it, rename the selected checklist item to 'Party Items', and lock the note named 'Personal Diary'.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the theme color of the app to Custom, then enable the incognito mode of keyboards and show the keyboard on startup.\",\n        \"solution\": \"Set the theme color of the app to Custom in the settings, enable the incognito mode for keyboards, and set the option to show the keyboard on startup.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Create a new text note titled 'Grocery List', activate the use of monospaced font, then increase the font size to 300%, and confirm it.\",\n        \"solution\": \"Create a new text note titled 'Grocery List', enable the use of monospaced font in the settings, increase the font size to 300%, and confirm the note.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Create a new checklist note titled 'Weekend Tasks' and confirm it, then set the theme color to Black & White, and enable automatic backups.\",\n        \"solution\": \"Create a new checklist note titled 'Weekend Tasks', confirm it, adjust the theme color to Black & White in the settings, and enable automatic backups.\"\n    }\n}\n```"}
{"720-750": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Travel Checklist', add items 'Passport', 'Tickets', and 'Sunscreen' to it, then move 'Sunscreen' to the top of the list.\",\n        \"solution\": \"Add a new note with the title 'Travel Checklist' and select the checklist type. Add 'Passport', 'Tickets', and 'Sunscreen' as items. Move the item 'Sunscreen' to the top of the list.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a new text note named 'Conference Outline', set the text alignment to justified, then set the font size to 125%.\",\n        \"solution\": \"Create a new text note with the title 'Conference Outline' and confirm it. Set the text alignment to justified in the current editing note. Set the font size to 125%.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Add a new note titled 'Weekly Plan' with checklist type, rename the first item to 'Gym Session', and move it to the bottom.\",\n        \"solution\": \"Add a new note with the title 'Weekly Plan' and select the checklist type. Rename the selected checklist item to 'Gym Session'. Move the selected checklist item to the bottom of the list.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Create a new text note called 'Recipe ideas', switch to a monospaced font, and enable line wrap in settings.\",\n        \"solution\": \"Create a new text note with the title 'Recipe ideas' and confirm it. Switch to a monospaced font for the coding notes. Enable line wrap in the Notes app settings.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a new checklist note titled 'Shopping List', add items 'Milk', 'Bread', 'Eggs', then delete 'Bread'.\",\n        \"solution\": \"Add a new note with the title 'Shopping List' and select the checklist type. Add 'Milk', 'Bread', and 'Eggs' as items. Delete the selected checklist item 'Bread'.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Create a new text note called 'Work Timetable', set the cursor to the end of the note when opened and set the theme color to auto light/dark.\",\n        \"solution\": \"Create a new text note with the title 'Work Timetable' and confirm it. Set the cursor to the end of the note when opened. Set the theme color to auto light/dark.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a new checklist note titled 'Meeting Agenda', add items 'Introduction', 'Project Updates', and 'Q&A', then move 'Q&A' to the top.\",\n        \"solution\": \"Create a new note with the title 'Meeting Agenda' and select the checklist type. Add 'Introduction', 'Project Updates', and 'Q&A' as items. Move the item 'Q&A' to the top of the list.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Add a new text note titled 'Daily Journal', lock the note with the password '12345', and enable incognito mode for the keyboard.\",\n        \"solution\": \"Create a new note with the title 'Daily Journal' and confirm it. Lock the note 'Daily Journal' with a password '12345'. Use incognito mode of keyboards while typing in the Notes app.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Add a new note titled 'Project Notes' with text note type, then enable the setting to show a note picker on startup.\",\n        \"solution\": \"Add a new note with the title 'Project Notes' and select the text note type. Activate the setting to show a note picker on startup.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Create a new text note titled 'Sprint Review Notes', set text alignment to justified, and set the keyboard to automatically appear when the app starts.\",\n        \"solution\": \"Create a new text note with the title 'Sprint Review Notes' and confirm it. Set the text alignment to justified in the current editing note. Set the keyboard to automatically appear when the app starts.\"\n    }\n}\n```"}
{"900-930": "```json\n{\n    'complex task 1': {\n        'task': 'Change the text color to green and set the font size to 175% in the Notes App.',\n        'solution': 'First, go into the settings of the Notes App. Change the text color option to green, then set the font size to 175%.'\n    }, \n    'complex task 2': {\n        'task': 'Rename the current note to \"Work Tasks\" and export it as a PDF file.',\n        'solution': 'Open the current note and rename it to \"Work Tasks\". After renaming, select the option to export the note as a PDF file.'\n    },\n    'complex task 3': {\n        'task': 'Enable automatic backups and display success messages when notes are saved.',\n        'solution': 'Go into the settings of the Notes App. Enable the automatic backups option, then enable the option to display success messages when notes are saved.'\n    }, \n    'complex task 4': {\n        'task': 'Scroll down the settings page, set the alignment of the text to center and enable line wrap.',\n        'solution': 'Scroll down to the appropriate section in the settings page, set the text alignment to center, and then enable the line wrap for easier reading of long paragraphs.'\n    },\n    'complex task 5': {\n        'task': 'Set the background color of the app to yellow and customize the widget colors to blue and yellow.',\n        'solution': 'Go to the settings page of the Notes App. Change the background color to yellow, then navigate to the widget customization section and set the widget colors to blue and yellow.'\n    }, \n    'complex task 6': {\n        'task': 'Delete the note \"Old Project Ideas\" after confirming and enable autosave notes in settings.',\n        'solution': 'First, find and delete the note titled \"Old Project Ideas\", confirm the deletion. Then, go into the settings and enable the autosave notes option.'\n    },\n    'complex task 7': {\n        'task': 'Use incognito mode for the keyboard and set the Notes App to show the keyboard on startup.',\n        'solution': 'Enable incognito mode for the keyboard to avoid saving typing history. Then, adjust the setting to ensure the keyboard is visible when the Notes App starts up.'\n    },\n    'complex task 8': {\n        'task': 'Set the app icon color to blue and enable the show word count option in Notes App.',\n        'solution': 'Open the settings of the Notes App. Change the app icon color to blue. Next, enable the option to show word count within the Notes App.'\n    }\n}\n```"}
{"870-900": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Customize the Notes App settings for optimal night usage.\",\n        \"solution\": \"Change the theme color to dark red for better night visibility, set the font size to 75% for better readability, and enable clickable links and emails in the settings of the Notes App.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Set up the Notes App for an efficient meeting workflow.\",\n        \"solution\": \"Rename the current note to 'Meeting Notes - April 27', enable autosave notes, set the cursor to automatically move to the end of the note when opened, and enable line wrapping in the Notes App settings.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Prepare the Notes App for daily task management and reporting.\",\n        \"solution\": \"Create a shortcut for the note titled 'Grocery List', remove done items from the checklist titled 'To-Do Today', and show the word count for each note.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Optimize the Notes App for detailed coding notes.\",\n        \"solution\": \"Use monospaced font for all notes, set the font size to 150%, and enable clickable links and emails in the note content.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Export project notes and prepare it for printing.\",\n        \"solution\": \"Export the current note as a PDF file, then print the note named 'Vacation Itinerary'.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Configure the Notes App for secure writing and note management.\",\n        \"solution\": \"Set the keyboards to use incognito mode in the Notes App, disable display save success messages, and enable autosave notes.\"\n    }\n}\n```"}
{"660-690": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new text note titled 'Grocery List', add checklist items 'Milk', 'Bread', 'Eggs', and move 'Bread' to the top.\",\n        \"solution\": \"First, create a new text note titled 'Grocery List', then add the checklist items 'Milk', 'Bread', and 'Eggs'. After that, select the 'Bread' checklist item and move it to the top of the list.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a new note titled 'Daily Journal', lock it, and set the font size of the app to 75%.\",\n        \"solution\": \"Begin by creating a new note with the title 'Daily Journal' and select the text note type. Next, lock the current note and then set the font size of the app to 75%.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new note titled 'Project Plan' with checklist type, add item 'Review documentation', rename it to 'Review project documentation', and move it to the bottom.\",\n        \"solution\": \"Start by adding a new note with the title 'Project Plan' and select the checklist type. Add a checklist item titled 'Review documentation', then rename this item to 'Review project documentation' and move it to the bottom of the list.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Add a new note titled 'Meal Prep' with checklist type, add items 'Buy ingredients', 'Prep meals', remove the done items, and print the note.\",\n        \"solution\": \"First, add a new note with the title 'Meal Prep' and select the checklist type. Add the checklist items 'Buy ingredients' and 'Prep meals'. Remove the done items from the checklist and then print the current note.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a shortcut for the note titled 'Vacation Plans' on my home screen and export all my notes to my Dropbox account.\",\n        \"solution\": \"Create a shortcut for the note titled 'Vacation Plans' on your home screen. Then proceed to export all your notes to your Dropbox account.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Create a new text note titled 'Project Ideas', lock it, and set the primary color of the app to dark blue.\",\n        \"solution\": \"First, add a new note with the title 'Project Ideas' and select the text note type. Lock the current note and then set the primary color of the app to dark blue.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Add a new checklist note titled 'Weekly Tasks', add items 'Laundry', 'Groceries', 'Email', move 'Email' to the top, and rename it to 'Send Emails'.\",\n        \"solution\": \"Create a new checklist note titled 'Weekly Tasks'. Add checklist items 'Laundry', 'Groceries', and 'Email'. Select 'Email', move it to the top of the list, and then rename it to 'Send Emails'.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Add a new note titled 'To-Do List', add items 'Vacuum', 'Dust', 'Mop', delete 'Dust', and move 'Mop' to the top.\",\n        \"solution\": \"Start by creating a new note titled 'To-Do List' and add the checklist items 'Vacuum', 'Dust', and 'Mop'. Delete the 'Dust' item and then move the 'Mop' item to the top of the list.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Change the app's font size to 50%, set the note font size to 125%, and display a success message after saving the notes.\",\n        \"solution\": \"Set the font size of the app to 50%. Change the font size of the notes to 125% to make it easier on the eyes. Finally, ensure that a success message is displayed after saving the notes.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Create a new checklist titled 'Travel Checklist', add items 'Book flight', 'Pack bags', lock the note, and print it.\",\n        \"solution\": \"First, create a new checklist note titled 'Travel Checklist'. Add the checklist items 'Book flight' and 'Pack bags'. Lock the current note and then print the note.\"\n    }\n}\n```"}
{"630-660": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Prepare a note for today's team meeting, title it 'Team Meeting', set the font size to 150%, and export it as a PDF.\",\n        \"solution\": \"Add a new note with the title 'Team Meeting' and select the text note type. Set the font size of the current note to 150%. Export the current note as a PDF file.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Set the app theme to light gray, change the app icon color to green, and save the settings.\",\n        \"solution\": \"Change the background color of the app to light gray. Change the app icon color to green. Save the current color settings.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a checklist titled 'Grocery List', add some items, and then remove all done items.\",\n        \"solution\": \"Add a new note with the title 'Grocery List' and select the checklist type. Remove all done items from my checklist titled 'Grocery Shopping'.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Import notes from Google Drive, lock the first note, and print the second note.\",\n        \"solution\": \"Import notes from my Google Drive. Lock the current note. Print the current note.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a new note for workout routines, rename it to 'Workout Routine', and set it as a checklist.\",\n        \"solution\": \"Add a new note with the title 'Workout Routine' and select the checklist type. Rename the current note to 'Workout Routine'.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Create a note titled 'Meeting Notes', set the font size to 125%, and export it as a file.\",\n        \"solution\": \"Add a new note with the title 'Meeting Notes' and select the text note type. Set the font size of the current note to 125%. Export the current note as a file.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Add a new checklist for 'Workout Plan', rename the first item to 'Cardio', and move it to the top.\",\n        \"solution\": \"Add a new note with the title 'Workout Plan' and select the checklist type. Rename the selected checklist item to 'Cardio'. Move the selected checklist item to the top of the list.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the font size of the app to 125%, enable automatic backups, and open the About section to view app information.\",\n        \"solution\": \"Set the font size of the app to 125%. Enable automatic backups for my notes. Open the About section to view app information.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Add a note titled 'Ideas', lock it, and confirm its creation.\",\n        \"solution\": \"Add a new note with the title 'Ideas' and select the text note type. Lock the current note. Confirm the creation of a new note.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Create a checklist titled 'Daily Routine', rename the first item to 'Morning Exercise', and then move it to the bottom of the list.\",\n        \"solution\": \"Add a new note with the title 'Daily Routine' and select the checklist type. Rename the selected checklist item to 'Morning Exercise'. Move the selected checklist item to the bottom of the list.\"\n    }\n}\n```"}
{"960-990": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Export the note 'Monthly report' as a file and then lock the note immediately after that\",\n        \"solution\": \"First export the note titled 'Monthly report' as a file through the export option. Once the export is complete, proceed to lock the same note to secure its content.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Change the font size of the app to 200%, print the current note, and then set the font size back to 75%\",\n        \"solution\": \"Set the font size of the app to 200% for better readability. Print the currently open note right after adjusting the font size. Lastly, revert the font size back to 75% for regular usage.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Open the settings page, set the font size to 60%, and then exit the settings page\",\n        \"solution\": \"Navigate to the app settings page, adjust the font size to 60% within the settings, and exit the settings page to return to the main interface.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Rename the selected checklist item 'get groceries' to 'buy groceries' and then immediately delete the checklist item 'Wash car'\",\n        \"solution\": \"First, locate and rename the checklist item from 'get groceries' to 'buy groceries'. Once the renaming is done, proceed to delete the checklist item labeled 'Wash car'.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Lock the note 'Personal diary' and then confirm the lock\",\n        \"solution\": \"Find the note titled 'Personal diary' in your list of notes and apply a lock to it for security. After locking the note, confirm the lock to ensure it is secure.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Open the note titled 'Important document', open the attached file, and then lock the note\",\n        \"solution\": \"Access and open the note titled 'Important document'. Within the note, open the file that is attached. After reviewing or editing the file, lock the note to protect its contents.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Set the font size of the app to 300% to assist viewing, print the note titled 'Recipe', and then set the font size back to 100%\",\n        \"solution\": \"Adjust the font size of the app to 300% to make it easier to read. Print the note titled 'Recipe' with the increased font size. After printing, revert the font size to 100% for normal usage.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Show the word count permanently at the bottom of the app and then use a monospaced font for better readability of code snippets\",\n        \"solution\": \"Activate the feature to display the word count at the bottom of the app for ongoing projects. Then change the font to a monospaced type to improve the readability of any code snippets stored in the notes.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Align text to the center for a formatted look of meeting notes and then set the theme color to dark red for night time usage\",\n        \"solution\": \"Navigate to the alignment settings and configure the text to be centered for your meeting notes to give it a formatted look. After that, change the theme color to dark red to reduce eye strain during night time.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Make all links and emails in notes clickable and lock the current note afterwards\",\n        \"solution\": \"Enable the setting that ensures all links and email addresses within your notes are clickable. Once this feature is activated, lock the currently open note to secure it.\"\n    }\n}\n```"}
{"1020-1050": "```json\n{\n    'complex task 1': {\n        'task': \"Sort the checklist items in 'Travel Planning' by their creation date, then remove all completed items.\",\n        'solution': \"First, sort the checklist items by creation date, then proceed to remove all completed items.\"\n    },\n    'complex task 2': {\n        'task': \"Enable automatic nightly backups at 2 AM and confirm the deletion of the note titled 'Outdated Meeting Notes'.\",\n        'solution': \"Set the app to perform automatic backups at 2 AM and then delete the note titled 'Outdated Meeting Notes', confirming the deletion.\"\n    },\n    'complex task 3': {\n        'task': \"Export notes related to the project 'Office Renovation' to a zip file and print the current note.\",\n        'solution': \"Export all notes pertaining to the 'Office Renovation' project to a zip file and then proceed to print the currently opened note.\"\n    },\n    'complex task 4': {\n        'task': \"Rename the note titled 'Final Report' to 'Project Launch Details' and enable the use of monospaced font in notes.\",\n        'solution': \"Change the name of the note 'Final Report' to 'Project Launch Details' and then enable the monospaced font option for notes.\"\n    },\n    'complex task 5': {\n        'task': \"Set the app's font size to 60%, show the word count for each note, and create a shortcut on the home screen for the note titled 'Annual Budget'.\",\n        'solution': \"Adjust the app's font size to 60%, enable the word count display for each note, and create a home screen shortcut for the note 'Annual Budget'.\"\n    },\n    'complex task 6': {\n        'task': \"Close the color settings menu without making changes, then open and print the file attached to the note 'Quarterly Review'.\",\n        'solution': \"First, close the color settings menu without saving any changes, then open the file attached to 'Quarterly Review' and print it.\"\n    },\n    'complex task 7': {\n        'task': \"Remove done items from the current checklist, then automatically save any changes in notes.\",\n        'solution': \"Remove all completed items from the current checklist and ensure that any changes made in notes are automatically saved.\"\n    },\n    'complex task 8': {\n        'task': \"Scroll through all available settings and enable the use of a monospaced font in notes.\",\n        'solution': \"Navigate through all settings options, then enable monospaced font usage for notes.\"\n    },\n    'complex task 9': {\n        'task': \"Print the note containing the minutes of the 'Marketing Meeting March 2024' and set the font size to 50%.\",\n        'solution': \"Print the note titled 'Marketing Meeting March 2024' and adjust the font size of the app to 50%.\"\n    },\n    'complex task 10': {\n        'task': \"Export all notes related to the project 'Website Redesign' to a zip file and enable automatic nightly backups at 2 AM.\",\n        'solution': \"Export the project-related notes to a zip file and activate automatic backups every night at 2 AM.\"\n    }\n}\n```"}
{"750-780": "```json\n{\n    'complex task 1': {\n        'task': 'Create a new note with the title \"Ideas for Project\", select the text note type, set the font size to 150%, and export it as a PDF file.',\n        'solution': 'Create the note, apply the desired font size, and then export the note as a PDF file.'\n    }, \n    'complex task 2': {\n        'task': 'Create a new note with the title \"Travel Packing List\", select the checklist type, sort the checklist items by title, and export it from the notes app.',\n        'solution': 'Create the checklist note, sort the items in alphabetical order, and then export the note.'\n    }, \n    'complex task 3': {\n        'task': 'Set the font size in the notes app to 150%, change the primary color to blue, and save these settings.',\n        'solution': 'Adjust the font size, change the primary color, and then save the changes made.'\n    }, \n    'complex task 4': {\n        'task': 'Add a new note titled \"Meeting Notes April 2024\", confirm creation, set the cursor to place at the end of the note, and make all links and emails clickable.',\n        'solution': 'Create the note, ensure the cursor is placed at the end of the note, and enable clickable links and emails.'\n    }, \n    'complex task 5': {\n        'task': 'Set the theme color to dark red, customize the widget colors to blue and green, and close the color setting popup.',\n        'solution': 'Select the theme color, adjust widget colors, and close the popup window.'\n    }, \n    'complex task 6': {\n        'task': 'Import notes in the notes app and display the word count for the documents.',\n        'solution': 'Import the notes and then enable the display of the word count for the imported documents.'\n    }, \n    'complex task 7': {\n        'task': 'Turn on the display save success messages feature, set the font size to 100%, and export notes from the notes app.',\n        'solution': 'Enable save success messages, adjust the font size to 100%, and export the notes.'\n    },\n    'complex task 8': {\n        'task': 'Create a new note with the title \"Creative Ideas\", select the text note type, and use monospaced font for better readability in the note',\n        'solution': 'Create the text note and apply a monospaced font setting for better readability.'\n    },\n    'complex task 9': {\n        'task': 'Add a new note titled \"Grocery List\", select the checklist type, sort the items by title, and move the selected checklist item to the bottom of the list.',\n        'solution': 'Create the checklist note, sort the items alphabetically, and move the selected item to the bottom.'\n    },\n    'complex task 10': {\n        'task': 'Create a new note with the title \"Daily To-Do\", select the checklist type, add several items, and delete one specific checklist item by name.',\n        'solution': 'Create the checklist note, add items, locate the specific item by name, and delete it.'\n    }\n}\n```"}
{"930-960": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Rename the current note to 'Travel Itinerary', then set the font size to 150% for easier reading, and finally enable line wrap to avoid horizontal scrolling while reading long notes.\",\n        \"solution\": \"First, rename the current note to 'Travel Itinerary'. Next, set the font size of the app to 150% for better readability. Lastly, enable line wrap in the app settings to ensure that long lines of text don't cause horizontal scrolling.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a shortcut for the note 'Project Plan', set the cursor position to the end of the note, and switch the theme to auto light/dark mode based on current lighting conditions.\",\n        \"solution\": \"First, find and create a shortcut for the note titled 'Project Plan'. Then, when opening the note, set the cursor position to the end. Finally, change the theme settings to auto light/dark mode to adapt to the current lighting conditions.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Input 'Workout Schedule' as the new name of the current note, set the font size of the app to the smallest setting at 60%, and ensure the keyboard shows immediately on startup for quick input.\",\n        \"solution\": \"Begin by renaming the current note to 'Workout Schedule'. Next, adjust the font size of the app to 60% to maximize the amount of text visible on the screen. Lastly, configure the app to show the keyboard immediately upon starting up the app for quick note-taking.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Enable incognito mode on the keyboard for enhanced privacy, then remove done items from the current checklist and make all links and email addresses in the note clickable.\",\n        \"solution\": \"First, activate incognito mode on the keyboard to ensure privacy while typing sensitive information. Next, remove any completed items from the current checklist to declutter it. Then, configure the app to make all URLs and email addresses within the note clickable for easy access.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Set the primary color of the app to blue to match my phone's theme, increase the font size to 150% for easier reading, and display a note picker on startup to quickly access recent notes.\",\n        \"solution\": \"First, go to the app settings and set the primary color to blue to match your phone's theme. Then, adjust the font size to 150% for better readability. Finally, configure the app to display a note picker upon startup, allowing quick access to recent notes.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Switch to the note 'Weekend shopping list,' make all links and email addresses clickable, and print the current note.\",\n        \"solution\": \"First, navigate to and open the note 'Weekend shopping list.' Ensure that all links and email addresses within the note are set as clickable. Finally, proceed to print the note for physical reference.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Create a shortcut for the note 'Office Supplies', move the selected item 'Printer Paper' to the top of the checklist, and confirm the deletion of the current note.\",\n        \"solution\": \"Start by creating a shortcut for the note titled 'Office Supplies'. Then, in the checklist within that note, move 'Printer Paper' to the top position. Finally, confirm and proceed with the deletion of the current note.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the alignment of the app to the default setting in the Notes App, customize the widget colors to match my phone's blue theme, and show the keyboard immediately on startup.\",\n        \"solution\": \"First, adjust the app's alignment to the default setting within the Notes App settings. Next, customize the widget colors to match the blue theme of your phone. Lastly, configure the app to display the keyboard immediately upon startup for quick and convenient note-taking.\"\n    }\n}\n```"}
{"1140-1170": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Save the current theme colors and then set the application theme color to dark in the Notes app.\",\n        \"solution\": \"First, save the current theme colors. Next, change the application theme color to dark.\"\n    }, \n    \"complex task 2\": {\n        \"task\": \"Adjust the app icon color to green and then enable autosave for notes in the Notes app.\",\n        \"solution\": \"First, adjust the app icon color to green. Then, enable autosave for notes.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Enable automatic backups and then change the application theme color to black and white in the Notes app.\",\n        \"solution\": \"First, enable automatic backups. Next, change the application theme color to black and white.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the font size to 75% and then sort the checklist items by title in the Notes app.\",\n        \"solution\": \"First, set the font size to 75%. Next, sort the checklist items by title.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Make the font size as large as possible and then enable the line wrap setting in the Notes app.\",\n        \"solution\": \"First, make the font size as large as possible. Then, enable the line wrap setting.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Increase the font size to 175% for better readability and then move the selected checklist item to the top of the list in the Notes app.\",\n        \"solution\": \"First, increase the font size to 175% for better readability. Next, move the selected checklist item to the top of the list.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Enable the display save success messages and then customize the colors of the widget in the Notes app.\",\n        \"solution\": \"First, enable the display save success messages in settings. Next, customize the colors of the widget.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Export notes and then exit the settings page in the Notes app.\",\n        \"solution\": \"First, export notes from settings. Next, exit the settings page.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Change the text color of the app to blue and set the cursor placement to the end of the note in the Notes app.\",\n        \"solution\": \"First, change the text color of the app to blue. Then, set the cursor placement to the end of the note.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Set the application to show keyboard on startup and then move the selected checklist item to the bottom of the list in the Notes app.\",\n        \"solution\": \"First, set the application to show keyboard on startup. Next, move the selected checklist item to the bottom of the list.\"\n    }\n}\n```"}
{"1080-1110": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Change the theme color of the app to dark, then increase the font size to 200%, and set the cursor to be placed at the end of the note by default.\",\n        \"solution\": \"Go to the settings page, set the theme color to dark, adjust the font size to 200%, and set the cursor to be placed at the end of the note by default.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Sort the items of the current checklist by Title and change the background color of the app to pink.\",\n        \"solution\": \"Go to the checklist and sort the items by Title, then change the background color of the app to pink in the settings.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Export all the notes, set the theme color of the app to dark red, and activate the option to make links and emails clickable.\",\n        \"solution\": \"Export all the notes through the export function, change the theme color to dark red, and activate the clickable links and emails option in the settings.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the font size in the Notes app to 300%, change the app icon color to black, and customize the widget colors to green.\",\n        \"solution\": \"Adjust the font size to 300% in the settings, change the app icon color to black, and customize the widget colors to green.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Change the text color to blue, sort the checklist by the date they were created, and export notes.\",\n        \"solution\": \"Change the text color to blue in the settings, sort the checklist by the date created, and then export notes.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Import notes from my external storage, set the theme color to a custom color, and save the chosen colors of the app.\",\n        \"solution\": \"Import notes from the external storage, set the theme color to your desired custom color, and save the chosen colors.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Set the cursor to the end of note in the Notes app, change the font size to 150%, and sort the items of the current checklist by Custom.\",\n        \"solution\": \"Set the cursor to the end of the note, adjust the font size to 150%, and sort the checklist items by Custom.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Change the theme color of the app to white, increase the font size to 90%, and exit the settings page.\",\n        \"solution\": \"Adjust the theme color to white, increase the font size to 90%, and exit the settings page.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Set the theme color to black and white, activate the option to make links and emails clickable, and close the setting colors pop-up window.\",\n        \"solution\": \"Set the theme color to black and white, enable clickable links and emails, and close the color settings pop-up.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Set the theme color to dark, increase the font size to 175%, and customize the widget colors to green.\",\n        \"solution\": \"Change the theme color to dark, increase the font size to 175%, and set the widget colors to green.\"\n    }\n}\n```"}
{"810-840": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Create a new checklist note titled 'Shopping List', add three items 'Milk', 'Bread', and 'Eggs', and then move 'Eggs' to the top of the list.\",\n        \"solution\": \"Add a new note with the title 'Shopping List' and select the checklist type. Add the checklist items 'Milk', 'Bread', and 'Eggs'. Move the checklist item 'Eggs' to the top of the list.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a new note titled 'Work Plan', set alignment to justified, and export it as a PDF file.\",\n        \"solution\": \"Add a new note with the title 'Work Plan' and select the text note type. Set the text alignment in all notes to justified. Export the current note as a PDF file.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Create a new note titled 'Daily Reflections', set the alignment to center, and change the font size to 150%.\",\n        \"solution\": \"Add a new note with the title 'Daily Reflections' and select the text note type. Set text alignment to center in the Notes app. Change the font size of the note to 150%.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Add a new text note with the title 'Fitness Goals' and customize the widget colors to match the primary color.\",\n        \"solution\": \"Add a new note with the title 'Fitness Goals' and select the text note type. Customize widget colors to match the primary color.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Create a new checklist note titled 'Travel Checklist', add items 'Passport' and 'Tickets', move 'Passport' to the bottom, and rename the note to 'Vacation Prep'.\",\n        \"solution\": \"Add a new note with the title 'Travel Checklist' and select the checklist type. Add the checklist items 'Passport' and 'Tickets'. Move the checklist item 'Passport' to the bottom of the list. Rename the current note to 'Vacation Prep'.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Create a new note titled 'Project Notes', set the theme color of the app to dark, and lock the note titled 'Personal Diary'.\",\n        \"solution\": \"Add a new note with the title 'Project Notes' and select the text note type. Set the theme color of the app to dark. Lock the note titled 'Personal Diary'.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Add a new note titled 'Weekly Overview' and then print the note titled 'Recipe Collection'.\",\n        \"solution\": \"Add a new note with the title 'Weekly Overview' and select the text note type. Print the note titled 'Recipe Collection'.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Create a new note titled 'Tech Innovations', set the theme to auto light/dark mode, and import notes from the download folder.\",\n        \"solution\": \"Add a new note with the title 'Tech Innovations' and select the text note type. Set the theme to auto light/dark mode. Import notes from the download folder.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Open the PDF file associated with the note titled 'Project Proposal' and then save the current color settings.\",\n        \"solution\": \"Open the PDF file associated with the note titled 'Project Proposal'. Save the current color settings.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Add a new note titled 'Daily Tasks', move the selected checklist item to the top, and then print the note titled 'Recipe Collection'.\",\n        \"solution\": \"Add a new note with the title 'Daily Tasks' and select the checklist type. Move the selected checklist item to the top of the list. Print the note titled 'Recipe Collection'.\"\n    }\n}\n```"}
{"990-1020": "```json\n{\n    'complex_task_1': {\n        'task': 'Set the font size in the Notes app to 90%, export the checklist titled \"Holiday Shopping\" as a PDF file, and then exit the settings menu.',\n        'solution': 'First, set the font size in the Notes app to 90%. Then, export the checklist titled \"Holiday Shopping\" as a PDF file. Finally, exit the settings menu.'\n    },\n    'complex_task_2': {\n        'task': 'Customize the colors of the widget in the Notes app, enable automatic backups for the notes, and save the custom color settings of the application.',\n        'solution': 'Begin by customizing the colors of the widget in the Notes app. Next, enable automatic backups for the notes. Finally, save the custom color settings of the application.'\n    },\n    'complex_task_3': {\n        'task': 'Set the font size in the Notes app to 125%, show a note picker on startup, and import notes from the backup file located in the \"Backup\" folder.',\n        'solution': 'First, set the font size in the Notes app to 125%. Then, enable the setting to show a note picker on startup in the Notes app. Finally, import notes from the backup file located in the \"Backup\" folder.'\n    },\n    'complex_task_4': {\n        'task': 'Remove done items from the checklist \"Daily Task\", sort the checklist items by their titles, and confirm custom sort for the checklist items.',\n        'solution': 'Start by removing done items from the checklist \"Daily Task\". Then, sort the checklist items by their titles. Lastly, confirm the custom sort for the checklist items.'\n    },\n    'complex_task_5': {\n        'task': 'Change the font size in the Notes app to 175%, enable line wrapping in notes, and display a message when a note is successfully saved.',\n        'solution': 'First, change the font size in the Notes app to 175%. Then, enable line wrapping in notes. Finally, set the app to display a message when a note is successfully saved.'\n    },\n    'complex_task_6': {\n        'task': 'Make all links and emails in the Notes app clickable, enable the incognito mode for typing notes, and confirm renaming the note to \"Groceries List\" by tapping OK.',\n        'solution': 'Begin by making all links and emails in the Notes app clickable. Next, enable the incognito mode for typing in notes. Finally, confirm renaming the note to \"Groceries List\" by tapping OK.'\n    },\n    'complex_task_7': {\n        'task': 'Customize the colors of the widget, show the about page of the app, and confirm locking the note by tapping OK.',\n        'solution': 'Start by customizing the colors of the widget. Then, show the about page of the app. Finally, confirm locking the note by tapping OK.'\n    },\n    'complex_task_8': {\n        'task': 'Set the font size to 60%, save the new color scheme for the app with light blue as the primary color and dark gray for the text, and close the color settings popup.',\n        'solution': 'Begin by setting the font size to 60%. Then, save the new color scheme for the app with light blue as the primary color and dark gray for the text. Lastly, close the color settings popup.'\n    }\n}\n```"}
{"1200-1230": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Import notes from the backup file in the Downloads folder, change the background color of the app to white, and set the font size of the app to 50%\",\n        \"solution\": \"First, import the notes from the backup file located in the Downloads folder. Next, navigate to the settings and change the background color to white. Finally, go to the font settings and adjust the font size to 50%.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Create a shortcut for the note titled 'Grocery List', then lock the note titled 'Personal Diary', and enable custom sorting for checklist items\",\n        \"solution\": \"Begin by creating a shortcut for the note titled 'Grocery List'. Then, lock the note titled 'Personal Diary'. Finally, enable the custom sorting option for checklist items in the settings.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Change the app theme to dark mode, customize the widget colors to match the new theme, and set the place cursor to the end of the note\",\n        \"solution\": \"Start by changing the app theme to dark mode. Once done, customize the widget colors to match the dark mode theme. Lastly, set the cursor placement preference to the end of the notes.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Export notes to the Downloads directory, set the sorting preference of checklist items to Title, and print the note containing the project outline\",\n        \"solution\": \"First, export all notes to the Downloads directory. Next, go to the checklist settings and set the sorting preference to Title. Finally, find the note containing the project outline and print it.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Turn off autosave for notes, change the app icon color to green, and increase the font size of the app text to 150%\",\n        \"solution\": \"Start by turning off the autosave feature for notes in the settings. Then, change the app icon color to green. Lastly, adjust the app text font size to 150% in the font settings.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Delete the note titled 'Old Receipts', make links and emails in the notes clickable, and confirm and close the checklist sorting options\",\n        \"solution\": \"Begin by locating and deleting the note titled 'Old Receipts'. Next, enable the feature to make links and emails in the notes clickable. Finally, navigate to the checklist sorting options, confirm the settings, and close the menu.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Sort the checklist items by their date of creation, set the primary color of the app to red, and save changes made to the colors of the app\",\n        \"solution\": \"First, sort the checklist items by their date of creation. Then, change the primary color of the app to red. Ensure to save the changes made to the color settings before exiting.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Enable the display of save success messages, print the note containing the project outline, and set the place cursor to the end of the note\",\n        \"solution\": \"Begin by enabling the display of save success messages in the settings. Next, locate and print the note containing the project outline. Finally, set the cursor placement to the end of the notes.\"\n    }\n}\n```"}
{"1170-1200": "```json\n{\n    'complex task 1': {\n        'task': 'Enable the use of monospaced font and set the font size to 150% for better readability in notes',\n        'solution': 'Enable the monospaced font option in settings. Then, change the font size to 150%.'\n    },\n    'complex task 2': {\n        'task': 'Change the application theme to dark red, then enable automatic backups',\n        'solution': 'First, navigate to the theme settings and change the theme color to dark red. Then, go to the settings and enable automatic backups.'\n    },\n    'complex task 3': {\n        'task': 'Rename the current note to \"Project Plan\" and activate the word count display',\n        'solution': 'Rename the note from the settings to \"Project Plan\". After that, navigate to the settings and activate the word count display.'\n    },\n    'complex task 4': {\n        'task': 'Sort the checklist items by date created and export the current checklist as a PDF file',\n        'solution': 'Go to the checklist settings and sort the items by date created. Then, use the export option to save the checklist as a PDF file.'\n    },\n    'complex task 5': {\n        'task': 'Change the theme color to white and decrease the font size to 50% for a more minimalistic view',\n        'solution': 'Switch the theme color to white in the theme settings. Then, change the font size to 50% from the font settings.'\n    },\n    'complex task 6': {\n        'task': 'Set the application to show a note picker on startup and import notes through settings',\n        'solution': 'In the settings, enable the option to show a note picker on startup. Then, use the import option to bring in notes through the settings.'\n    },\n    'complex task 7': {\n        'task': 'Enable automatic backups, then change the font size to 125% for clarity',\n        'solution': 'First, enable the automatic backup feature in the settings. Then, adjust the font size to 125% from the font settings.'\n    },\n    'complex task 8': {\n        'task': 'Sort the checklist items in a custom type and rename the selected checklist item to \"Key Task\"',\n        'solution': 'Use the sorting option in the checklist settings to sort items in a custom type. Then, rename the selected checklist item to \"Key Task\".'\n    },\n    'complex task 9': {\n        'task': 'Switch the theme color to Auto light/dark and ensure the font size is set to 100%',\n        'solution': 'Change the theme color to Auto light/dark in the theme settings. Then, verify that the font size is set to 100% in the font settings.'\n    },\n    'complex task 10': {\n        'task': 'Set autosave notes in settings and decrease the font size to 75% for compact viewing',\n        'solution': 'Enable the autosave notes feature in the settings. Then, decrease the font size to 75% from the font settings.'\n    }\n}\n```"}
{"1260-1290": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Change the font size to 75%, scroll through the settings page, and set the alignment of the text to center.\",\n        \"solution\": \"First, change the font size to 75%. Then, scroll through the settings page. Finally, set the alignment of the text to center.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Rename the current note to 'Meeting Notes', sort the checklist items by the date they were created, and enable automatic backups for my notes.\",\n        \"solution\": \"First, rename the current note to 'Meeting Notes'. Next, sort the checklist items by the date they were created. Finally, enable automatic backups for your notes.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Export the current note as a PDF file, enable display of save success messages, and create a shortcut for the current note on the home screen.\",\n        \"solution\": \"First, export the current note as a PDF file. Then, enable the display of save success messages. Finally, create a shortcut for the current note on the home screen.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the font size of the app to 100%, change the theme color of the app to Dark Red, and show the word count in my notes.\",\n        \"solution\": \"First, set the font size of the app to 100%. Next, change the theme color of the app to Dark Red. Then, show the word count in your notes.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Use monospaced font in my notes, autosave my notes, and decrease the font size to 60%.\",\n        \"solution\": \"First, use a monospaced font in your notes. Then, enable autosave for your notes. Afterwards, decrease the font size to 60%.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Set the font size of the app to 150%, confirm the sort type of the current checklist items, and remove all completed items from the checklist.\",\n        \"solution\": \"First, set the font size of the app to 150%. Then, confirm the sort type of the current checklist items. Finally, remove all completed items from the checklist.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Set the font size of the app to 300%, sort the items of the current checklist by date created, and export notes from the app.\",\n        \"solution\": \"First, set the font size of the app to 300%. Next, sort the items of the current checklist by date created. Then, export notes from the app.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the font size of the app to 125%, rename the selected checklist item to 'Grocery Shopping', and scroll through the settings page.\",\n        \"solution\": \"First, set the font size of the app to 125%. Next, rename the selected checklist item to 'Grocery Shopping'. Lastly, scroll through the settings page.\"\n    }\n}\n```"}
{"1050-1080": "```json\n{\n    \"Set and confirm password lock for personal diary, then show the about page of the notes app\": {\n        \"task\": \"Lock the note 'Personal Diary', confirm with a password, and then view the about page of the notes app.\",\n        \"solution\": \"First, lock the 'Personal Diary' note and confirm it with a password. After confirming, navigate to the about page to view the app version and latest updates.\"\n    },\n    \"Increase font size to 300%, change text color, then sort checklist items by title\": {\n        \"task\": \"Set the font size in the Notes app to 300%, change the text color in the notes app, then sort the checklist items by title.\",\n        \"solution\": \"First, change the font size to 300%. Secondly, change the text color in the notes app. Finally, sort checklist items by title for better organization.\"\n    },\n    \"Change app icon color, then lock the current note and confirm\": {\n        \"task\": \"Change the app icon color in the notes app, then lock the current note and confirm the lock.\",\n        \"solution\": \"Begin by changing the app icon color. Then proceed to lock the currently opened note and confirm the operation.\"\n    },\n    \"Scroll down to access advanced security options, set success display message, and confirm\": {\n        \"task\": \"Scroll down the settings page to access the advanced security options, then set the app to display a success message whenever settings are successfully saved, and confirm.\",\n        \"solution\": \"Scroll down the settings to find advanced security options. After changing the settings to display success messages, confirm the changes.\"\n    },\n    \"Import notes, change font size to 100% and set background color\": {\n        \"task\": \"Import notes into the app, set the font size in the Notes app to 100%, and then change the background color in the notes app.\",\n        \"solution\": \"Start by importing the notes. Then set the font size to 100% for standard viewing. Finally, change the background color.\"\n    },\n    \"Adjust font size for better readability, change alignment, then sort checklist\": {\n        \"task\": \"Set the font size in the Notes app to 125% for better readability, change the alignment setting, and then sort the checklist items by custom order.\",\n        \"solution\": \"First, adjust the font size to 125%. Next, make changes to the alignment setting before sorting the checklist items by a custom order.\"\n    },\n    \"Turn off display save success messages and reduce font size to 50%\": {\n        \"task\": \"Turn off the display save success messages in the settings, then reduce the font size in the Notes app to 50% to maximize screen space.\",\n        \"solution\": \"In the settings, first turn off the option to display save success messages. Afterward, reduce the font size to 50%.\"\n    }\n}\n```"}
{"1320-1350": "```json\n{\n    'complex task 1': {\n        'task': 'Set the theme color to Dark, change the font size to 75%, and enable autosave notes in the app.',\n        'solution': 'First, set the theme color to Dark by navigating to the color settings and selecting Dark. Then, adjust the font size to 75% from the font size settings. Finally, enable the autosave notes feature in the settings menu.'\n    },\n    'complex task 2': {\n        'task': 'Set the font size to 125%, change the text color to red, and export notes to my Dropbox account.',\n        'solution': 'Adjust the font size to 125% in the font settings. Change the text color to red from the text color settings. Finally, choose the option to export notes and select Dropbox as the destination account.'\n    },\n    'complex task 3': {\n        'task': 'Enable automatic backups to iCloud every day, set the theme color to Black & White, and change the background color to yellow.',\n        'solution': 'Go to the backup settings and enable automatic backups to iCloud for daily frequency. Change the theme color to Black & White by selecting it from the theme settings. Then, modify the background color to yellow in the background settings.'\n    },\n    'complex task 4': {\n        'task': 'Set the font size to 100%, rename the current note to \"Meeting Notes\", and enable autosave notes every 5 minutes.',\n        'solution': 'Change the font size to 100% in the font settings. Rename the current note to \"Meeting Notes\" by selecting the rename option. Lastly, enable autosave notes with a frequency of 5 minutes in the autosave settings.'\n    },\n    'complex task 5': {\n        'task': 'Set the font size to 300%, change the theme color to Dark red, and close the theme color settings window.',\n        'solution': 'Adjust the font size to 300% in the font settings. Change the theme color to Dark red in the theme settings. After changing, close the theme color settings window.'\n    },\n    'complex task 6': {\n        'task': 'Change the font size to 50%, change the app icon color to green, and save the current theme color settings.',\n        'solution': 'Adjust the font size to 50% in the font settings. Change the app icon color to green from the icon color settings. Then, save the current theme color settings from the theme color settings menu.'\n    },\n    'complex task 7': {\n        'task': 'Change the font size to 175%, set the theme color to Dark, and export the current note as a file.',\n        'solution': 'Adjust the font size to 175% in the font settings. Set the theme color to Dark by selecting it from the theme settings. Finally, export the current note as a file by choosing the export option.'\n    },\n    'complex task 8': {\n        'task': 'Set the font size to 200%, change the background color to yellow, and set the theme color to Custom.',\n        'solution': 'Adjust the font size to 200% in the font settings. Change the background color to yellow in the background settings. Then, set the theme color to Custom from the theme settings.'\n    }\n}\n```"}
{"1110-1140": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Set the font size to 150%, turn on the auto light/dark theme, and sort checklist items by title in the Notes app.\",\n        \"solution\": \"First, change the font size to 150%. Then, enable the auto light/dark theme. Finally, sort the checklist items by title.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Enable autosave, change the font size to 75%, and export notes from the Notes app.\",\n        \"solution\": \"Start by enabling the autosave notes feature. Then, change the font size to 75%. Finally, proceed to export the notes.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Turn on automatic backups, set the theme color to white, and sort checklist items by date created in the Notes app.\",\n        \"solution\": \"Begin by turning on the automatic backups for your notes. Next, set the theme color to white. Lastly, sort the checklist items by date created.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Set the font size to 90%, change the text color to blue, and import notes into the Notes app.\",\n        \"solution\": \"First, change the font size to 90%. Then, change the text color to blue. Finally, import your notes into the app.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Set the font size to 125%, change the theme color to light grey, and confirm the sort type before closing the sorting popup in the Notes app.\",\n        \"solution\": \"Initially change the font size to 125%. Then, set the background color to light grey. Finally, confirm the sort type and close the sorting popup.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Change the font size to 100%, set the theme color to light, and sort checklist items by custom order in the Notes app.\",\n        \"solution\": \"First, change the font size to 100%. Then, set the app theme color to light. Finally, sort the checklist items by custom order.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Change the font size to 90%, sort checklist items by title, and enable the autosave feature in the Notes app.\",\n        \"solution\": \"To start, change the font size to 90%. Then, sort the checklist items by title. Lastly, enable the autosave notes feature.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the font size to 175%, turn on auto light/dark theme, and export notes from the Notes app.\",\n        \"solution\": \"First, change the font size to 175%. Then, enable the auto light/dark theme. Lastly, export the notes from the app.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Set the theme color to white, change the font size to 200%, and sort checklist items by date created in the Notes app.\",\n        \"solution\": \"Begin by setting the theme color to white. Next, change the font size to 200%. Finally, sort the checklist items by date created.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Enable autosave, set the font size to 90%, and import notes into the Notes app.\",\n        \"solution\": \"To begin, enable the autosave feature. Then, change the font size to 90%. Lastly, import your notes into the app.\"\n    }\n}\n```"}
{"1380-1410": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Change the app theme color to dark red and set the font size to 250% to improve readability.\",\n        \"solution\": \"Change the theme color to dark red, then set the font size to 250%.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Rename the selected checklist item to 'Buy Groceries' and move it to the top of the list in the Notes app.\",\n        \"solution\": \"Rename the selected checklist item to 'Buy Groceries', then move it to the top of the list.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Import notes in the app and change the text color and background color for better visibility.\",\n        \"solution\": \"Import notes, then change the text color and background color.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Enable clickable links and email addresses in my notes and enable line wrap for easier reading of long notes.\",\n        \"solution\": \"Enable clickable links and email addresses, then enable line wrap.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Set the font size in the Notes app to 100% and after that, change the font size to 150%.\",\n        \"solution\": \"Set the font size to 100%, then change it to 150%.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Customize widget colors and change the primary color to blue.\",\n        \"solution\": \"Customize widget colors, then change the primary color to blue.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Delete the selected checklist item and then sort the remaining items of the current checklist by custom order.\",\n        \"solution\": \"Delete the selected checklist item, then sort the remaining items by custom order.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Change the text color in the Notes app and set the cursor to the end of the note when I open the app.\",\n        \"solution\": \"Change the text color, then set the cursor to the end of the note.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Set the font size in the app to 90% and then change it to 125% for better readability.\",\n        \"solution\": \"Set the font size to 90%, then change it to 125%.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Delete the current note and import new notes into the app.\",\n        \"solution\": \"Delete the current note, then import new notes.\"\n    }\n}\n```"}
{"1230-1260": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Configure the Notes app for better productivity by enabling all the enhanced features and aesthetics.\",\n        \"solution\": \"Enable the word count feature. Switch to using monospaced font. Change the primary color of the app to red. Set the background color in the Notes app to light grey. Enable line wrap in my notes. Show the keyboard automatically on startup. Enable auto save option for the notes.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Prepare the app for a presentation by optimizing font and color settings and ensuring data security.\",\n        \"solution\": \"Change the font size to 100%. Change the text color in the Notes app to blue. Save the color settings of the app. Enable automatic backups in the app. Export all notes to a zip file and save to external storage.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Set the application to focus on editing with readability and user interface settings optimized.\",\n        \"solution\": \"Increase the font size in the Notes app to 150%. Set the primary color in the Notes app to red. Enable line wrap in my notes. Show save success messages when I edit notes. Activate automatic backups in the app.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Get the application ready for work by configuring authentication and backup settings, and prepare a specific file for editing.\",\n        \"solution\": \"Set up automatic backups to occur every night. Enable auto save option for the notes. Open the file associated with the note 'Work Presentation'. Use Incognito mode for the keyboard in the app. Show a note picker on startup.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Customize the Notes app and rearrange a checklist to meet personal preferences.\",\n        \"solution\": \"Change the primary color of the app to red. Adjust the app icon color in the Notes app to green. Move the selected checklist item to the bottom of the list. Move the selected checklist item to the top of the list. Confirm the custom sorting of my checklist items.\"\n    }\n}\n```"}
{"1290-1320": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Change the text color to blue and then set the font size to 150% in the Notes app.\",\n        \"solution\": \"First, change the text color to blue. Then, adjust the font size to 150%.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Delete the current note after confirming and then print the next note in the Notes app.\",\n        \"solution\": \"Confirm and delete the current note. Then, navigate to the next note and send it to print.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Switch the Notes app theme to dark mode and then increase the font size to 200%.\",\n        \"solution\": \"Change the theme to dark mode. Next, adjust the font size to 200%.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Lock the current note with the password 'Secure123' and then change the background color to light gray.\",\n        \"solution\": \"Lock the current note using the password 'Secure123'. Then, set the background color to light gray.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Switch the theme to light mode, then adjust the font size to 50% in the Notes app.\",\n        \"solution\": \"Set the theme color to light. Next, change the font size to 50%.\"\n    },\n    \"complex task 6\": {\n        \"task\": \"Import notes from Google Drive backup and then set the app icon color to green.\",\n        \"solution\": \"First, import notes from your Google Drive backup. Then, change the app icon color to green.\"\n    },\n    \"complex task 7\": {\n        \"task\": \"Sort the checklist items by date created, and then delete the selected checklist item.\",\n        \"solution\": \"First, sort the checklist items by date created. Next, delete the selected checklist item.\"\n    },\n    \"complex task 8\": {\n        \"task\": \"Set the theme to dark red and then change the primary color to teal in the Notes app.\",\n        \"solution\": \"Set the theme color to dark red. After that, change the primary color to teal.\"\n    },\n    \"complex task 9\": {\n        \"task\": \"Toggle the theme color to auto light/dark mode, then adjust the font size to 175%.\",\n        \"solution\": \"Turn on the auto light/dark theme setting. Then, set the font size to 175%.\"\n    },\n    \"complex task 10\": {\n        \"task\": \"Set the app icon color to red, then make the font size 50%.\",\n        \"solution\": \"First, set the app icon color to red. Next, change the font size to 50%.\"\n    }\n}\n```"}
{"1410-1440": "```json\n{\n    \"complex task 1\": {\n        \"task\": \"Set the font size to 150%, change the theme color of the notes app to auto light/dark mode, and enable autosave.\",\n        \"solution\": \"First, set the font size of the app to 150%, then change the theme color to auto light/dark mode, and finally enable autosave for all notes.\"\n    },\n    \"complex task 2\": {\n        \"task\": \"Sort all checklist items by title, show the word count at the bottom of each note, and set the font to a monospaced style.\",\n        \"solution\": \"First, sort the items of the current checklist by title, then enable the word count display at the bottom of each note, and change the font to a monospaced style.\"\n    },\n    \"complex task 3\": {\n        \"task\": \"Change the font size to 90%, set the app theme to switch between light and dark modes based on time, and ensure that the keyboard is shown when starting the app.\",\n        \"solution\": \"First, change the font size of the app to 90%, then set the app theme to automatically switch between light and dark modes based on the time of day, and finally ensure that the keyboard is shown at startup.\"\n    },\n    \"complex task 4\": {\n        \"task\": \"Enable Incognito mode for the keyboard, set the alignment of notes to be center-aligned, and change the theme color to Black & White.\",\n        \"solution\": \"First, enable Incognito mode for the keyboard, then set the alignment of your notes to be center-aligned, and change the theme color of the notes app to Black & White.\"\n    },\n    \"complex task 5\": {\n        \"task\": \"Set the font size to 250%, center-align all notes, and autosave notes after every change.\",\n        \"solution\": \"First, change the font size of the app to 250%, then set the alignment of your notes to be center-aligned, and finally enable autosave for all changes made to notes.\"\n    }\n}\n```"}
{"1350-1380": "```json\n{\n    'complex task 1': {\n        'task': 'Change the font size to 150% and print the current note titled \"Project Plan\".',\n        'solution': 'First, set the font size to 150%, and then print the current note titled \"Project Plan\".'\n    },\n    'complex task 2': {\n        'task': 'Rename the current note to \"Shopping List\", create a shortcut on the home screen, and set the primary color to blue.',\n        'solution': 'First, rename the current note to \"Shopping List\", then create a shortcut of it on the home screen, and finally change the primary color to blue.'\n    },\n    'complex task 3': {\n        'task': 'Customize the widget colors to purple, set the app theme color to auto light/dark, and reduce the font size in the Notes app to 50%.',\n        'solution': 'First, customize the widget colors to purple, then set the app theme color to auto light/dark, and finally reduce the font size in the Notes app to 50%.'\n    },\n    'complex task 4': {\n        'task': 'Set the font size to 75%, switch to the Black & White theme, and lock the current note titled \"To-Do List\".',\n        'solution': 'First, set the font size to 75%, then switch to the Black & White theme, and finally lock the current note titled \"To-Do List\".'\n    },\n    'complex task 5': {\n        'task': 'Adjust the primary color to teal, set the font size to 200%, and export the current note titled \"Weekly Report\" as a file.',\n        'solution': 'First, adjust the primary color to teal, then set the font size to 200%, and finally export the current note titled \"Weekly Report\" as a file.'\n    },\n    'complex task 6': {\n        'task': 'Change the background color to light gray, set the font size to 100%, and delete the current note titled \"Old Notes\".',\n        'solution': 'First, change the background color to light gray, then set the font size to 100%, and finally delete the current note titled \"Old Notes\".'\n    },\n    'complex task 7': {\n        'task': 'Set the font size to 75%, enable the Custom theme color option and set it to a gradient of blue and green, and print the current note titled \"Lecture Notes\".',\n        'solution': 'First, set the font size to 75%, then enable the Custom theme color option and set it to a gradient of blue and green, and finally print the current note titled \"Lecture Notes\".'\n    },\n    'complex task 8': {\n        'task': 'Scroll down the settings page, show the information of the app, and change the theme color to Dark Red.',\n        'solution': 'First, scroll down the settings page, then show the information of the app, and finally change the theme color to Dark Red.'\n    }\n}\n```"}
{"690-720": "```json\n{\n    'complex task 1': {\n        'task': 'Create a note titled \"Vacation Plans\" with a checklist type, add checklist items \"Book Flights\", \"Reserve Hotel\", \"Pack Bags\", and then move \"Pack Bags\" to the top of the list',\n        'solution': 'First, add a new note with the title \"Vacation Plans\" and select the checklist type. Then, add checklist items \"Book Flights\", \"Reserve Hotel\", \"Pack Bags\". Finally, move the checklist item \"Pack Bags\" to the top of the list.'\n    },\n    'complex task 2': {\n        'task': 'Create a note titled \"Grocery List\" with a checklist type, add items \"Buy Milk\", \"Buy Bread\", \"Buy Eggs\", and then delete the item \"Buy Bread\"',\n        'solution': 'First, add a new note with the title \"Grocery List\" and select the checklist type. Then, add checklist items \"Buy Milk\", \"Buy Bread\", and \"Buy Eggs\". Finally, delete the checklist item \"Buy Bread\".'\n    },\n    'complex task 3': {\n        'task': 'Add a new note titled \"Project Proposal\" with a text note type, set the font size to 200%, enable clickable links, and set the cursor to appear at the end of the note when opening it',\n        'solution': 'First, add a new note with the title \"Project Proposal\" and select the text note type. Then, set the font size to 200%, enable clickable links in the settings, and configure the cursor to appear at the end of the note when opening it.'\n    },\n    'complex task 4': {\n        'task': 'Create a checklist type note titled \"Home Renovation Tasks\", add items \"Paint Walls\", \"Install New Cabinets\", and \"Replace Flooring\", then rename \"Replace Flooring\" to \"Change Flooring\"',\n        'solution': 'First, add a new note with the title \"Home Renovation Tasks\" and select the checklist type. Then, add checklist items \"Paint Walls\", \"Install New Cabinets\", and \"Replace Flooring\". Finally, rename the checklist item \"Replace Flooring\" to \"Change Flooring\".'\n    },\n    'complex task 5': {\n        'task': 'Create a text note titled \"Conference Notes\", set the font size to 250% for a presentation, and lock the note and confirm',\n        'solution': 'First, add a new note with the title \"Conference Notes\" and select the text note type. Then, set the font size to 250% for the presentation view, and finally, lock the note and confirm the action.'\n    },\n    'complex task 6': {\n        'task': 'Rename the selected checklist item to \"Important Task\", move it to the top, and increase the font size to 175%',\n        'solution': 'First, rename the selected checklist item to \"Important Task\". Then, move it to the top of the list and set the font size to 175%.'\n    },\n    'complex task 7': {\n        'task': 'Create a note titled \"Office Setup\", add checklist items \"Order Desk\", \"Buy Chair\", and \"Install Monitor\", then confirm creation and print the note',\n        'solution': 'First, add a new note with the title \"Office Setup\" and select the checklist type. Then, add checklist items \"Order Desk\", \"Buy Chair\", and \"Install Monitor\". Confirm the creation and finally print the note.'\n    },\n    'complex task 8': {\n        'task': 'Create a note titled \"Birthday Plan\", add checklist items \"Send Invitations\", \"Order Cake\", \"Buy Decorations\", move \"Order Cake\" to the top, and then set the font size to 200%',\n        'solution': 'First, add a new note with the title \"Birthday Plan\" and select the checklist type. Then, add checklist items \"Send Invitations\", \"Order Cake\", and \"Buy Decorations\". Move \"Order Cake\" to the top of the list and set the font size to 200%.'\n    },\n    'complex task 9': {\n        'task': 'Create a text note titled \"Weekly Report\", confirm the creation, and then set the font size to 175% and lock the note with confirmation',\n        'solution': 'First, add a new note with the title \"Weekly Report\" and select the text note type. Confirm the creation of the note. Then, set the font size to 175% and finally lock the note and confirm the action.'\n    },\n    'complex task 10': {\n        'task': 'Create a note titled \"Gym Schedule\" with a checklist type, add items \"Monday - Cardio\", \"Wednesday - Strength Training\", \"Friday - Yoga\", and then move \"Friday - Yoga\" to the bottom of the list',\n        'solution': 'First, add a new note with the title \"Gym Schedule\" and select the checklist type. Then, add checklist items \"Monday - Cardio\", \"Wednesday - Strength Training\", and \"Friday - Yoga\". Finally, move the checklist item \"Friday - Yoga\" to the bottom of the list.'\n    }\n}\n```"}
